[
  {
    "clan": "Aburame Clan",
    "title": "Ability Score Increase (Aburame)",
    "details": "+2 Intelligence, +1 Wisdom"
  },
  {
    "clan": "Aburame Clan",
    "title": "Speed (Aburame)",
    "details": "Your base walking speed is 30 feet"
  },
  {
    "clan": "Aburame Clan",
    "title": "Skill Proficiencies (Aburame)",
    "details": "Nature, Animal Handling"
  },
  {
    "clan": "Aburame Clan",
    "title": "Extra Language (Aburame)",
    "details": "Insect-Speak, you can understand and speak to insects."
  },
  {
    "clan": "Aburame Clan",
    "title": "Parasitic Technique",
    "details": "You know 1 additional Aburame Clan D-Rank Ninjutsu.\n Aburame Features"
  },
  {
    "clan": "Aburame Clan",
    "title": "Aburame Clan Jutsu",
    "details": "The Aburame Clan has access to a separate list of jutsu unique to their clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list(s)."
  },
  {
    "clan": "Aburame Clan",
    "title": "Bug Host",
    "details": "Beginning at 1st level, you gain a +1 bonus to any Constitution saving throw you make, as the bugs inside of your body fight to resist whatever detrimental effect may be harming you. This bonus increases to +2 at 11th level and +3 at 18th level. At 7th level this bonus can be applied to Wisdom saving throws as well."
  },
  {
    "clan": "Aburame Clan",
    "title": "Chakra Sense",
    "details": "Also at 1st Level, by spending 1 minute focusing on communicating and controlling the insects in the surrounding area, you can sense creatures that utilize Chakra within a 1-mile radius and what direction they are in. Beginning at 11th level, creatures with Chakra sight cannot discern you and creatures of your choice within 15 feet of you from a common large insect by viewing Chakra alone."
  },
  {
    "clan": "Aburame Clan",
    "title": "Chakra Consumption",
    "details": "Starting at 3rd Level, when using Aburame clan jutsu you can choose to either deal the jutsu’s listed damage or deal Chakra damage to the target creature. When you do, you gain a number of temporary Chakra points equal half to the rank of the jutsu cast. (D-Rank: 2, C-Rank: 3, B-Rank: 4, A-Rank: 5, S-Rank: 6). This temporary Chakra lasts for 1 minute. If you would deal Chakra damage to a creature who has 0 Chakra, you instead deal twice the result as Poison damage."
  },
  {
    "clan": "Aburame Clan",
    "title": "Insect Focus",
    "details": "Starting at 7th Level you learn to focus on and specialize in a particular type of insect. Select the insect you wish to specialize in and gain the feature it comes with. You may select another type at 11th and 15th level.."
  },
  {
    "clan": "Aburame Clan",
    "title": "Beetles",
    "details": "Once per turn, when rolling a Wisdom based skill check, you may roll an additional 1d4, adding it to your result."
  },
  {
    "clan": "Aburame Clan",
    "title": "Parasites",
    "details": "When you deal damage to a creature with an Aburame clan jutsu, as a bonus action, you may force a creature to make a constitution save against vs your Ninjutsu Save DC. On a failed save you infect their body with parasitic insects. At the start of their turns, for up to 1 minute, they take 1d6 poison damage from the insects eating at their body. They can attempt another save at the end of each of their turns to end the effect. For the duration of this feature while a creature remains infected, each time you deal damage with an Aburame clan Hijutsu, increase the damage they take from this feature, at start of their turns by 1 damage die, up to a max of 5d6."
  },
  {
    "clan": "Aburame Clan",
    "title": "Kikaichu Swarm",
    "details": "When using the Chakra Consumption clan feature, when you would deal Chakra damage, roll an additional damage die, adding the result. Also, When you would deal damage using an Aburame Clan jutsu, you can choose to ignore resistance to Poison damage with said Hijutsu."
  },
  {
    "clan": "Aburame Clan",
    "title": "Nano-Insects",
    "details": "You gain a new form of attack other Aburame are unable to imitate. As an Action you can use the following; \n Nano-Insect Swarm. Ranged Ninjutsu Attack, 60 feet range, dealing Xd4+ Ninjutsu ability Modifier poison damage on a hit. (X = Your Proficiency bonus.) \n Beginning at 11th level, this damage counts as damage being dealt by an Aburame Clan Hijutsu for the purpose of triggering or interacting with Aburame Clan Clan features."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Ability Score Increase (Akimichi)",
    "details": "+2 Con, +1 Str"
  },
  {
    "clan": "Akimichi Clan",
    "title": "Speed (Akimichi)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Skill Proficiencies (Akimichi)",
    "details": "Athletics, Survival\n Akimichi Features"
  },
  {
    "clan": "Akimichi Clan",
    "title": "Akimichi Clan Jutsu",
    "details": "The Akimichi have access to a separate list of jutsu unique to their Clan. You can add these jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Lunch Breaks",
    "details": "When you take a short rest, you regain additional Hit Points equal to twice your current Calories."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Calories",
    "details": "At first level you have a set number of Calories equal to your Level+ your constitution modifier (Min.1). You gain 1 Calorie every level hereafter. You regain a number of calories equal to your constitution modifier after a short Rest, and all calories after a long or Full Rest. You can spend these Calories to use Clan Jutsu or Clan Features."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Food Pills",
    "details": "At 3rd Level, the you gain access to a special form of military food pills. These Pills enhance the intensity of your metabolism allowing for powerful bonuses based on which pill you take. The Pills can be taken in whichever order you wish once you gain access to them. Regardless, if you ever take two of these pills during a single initiative, one minute after consumption you must make a DC 18 Constitution Save. On a failure you gain 4 ranks of Weakened for the next 10 minutes, which cannot be removed, unless by a Jutsu that removes conditions of at least B-Rank cast on you. You gain each pill at the described levels.\n If you would consume all three pills, after 1 minute you enter the unconscious condition. Every 10 minutes thereafter, you must make a DC 23 Constitution save. If you fail this save three times in 1 hour, you drop to 0 hit points and begin Dying. While dying in this way, you cannot regain hit points. The only way to be stabilized is to have a Jutsu, with the Medical keyword that removes conditions of at least A-Rank cast on you. If you are not stabilized within 1 hour after entering this state, you die.\n Beginning at 18th level, you cannot fall unconscious as a result of consuming all three pills."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Green Spinach Pill",
    "details": "At 3rd level, you gain the green spinach pill. As a Bonus action you can eat this pill. Upon consumption, you must spend 3 calories. When you do, you gain +4 to your Strength ability score, +2 to your constitution saving throws, and temporary hit points equal to your level, for the next minute. You can gain the benefit for this pill, twice per rest."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Yellow Curry Pill",
    "details": "At 7th Level, you gain the yellow curry pill. As a Bonus action you can eat this pill. Upon consumption, you must spend 5 calories. When you do, increase the damage die of all unarmed attacks and Taijutsu you cast by 1 Step (d4> d6> d8> d10> d12) for 1 minute. You can gain the benefit of this pill, twice per long rest."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Red Chili Pill",
    "details": "At 11th Level, you gain the Red Chili Pill. As a Bonus action you can eat this pill. Upon consumption, you must spend 7 Calories. Increase the damage die of Unarmed attacks by +1, and Akimichi Clan Jutsu by +2, for 1 minute. You can gain the benefit of this pill, twice per long rest."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Fat Insulation",
    "details": "Beginning at 15th level, your fat protects you from harmful conditions. When you would suffer the Shocked or Chilled conditions you can spend 4 Calories to end one of such conditions."
  },
  {
    "clan": "Akimichi Clan",
    "title": "Master Metabolic Manipulation",
    "details": "At 18th level you reduce the calorie cost of all Akimichi Clan Jutsu by 2 (Min of 1)"
  },
  {
    "clan": "Bakuton Clan",
    "title": "Ability Score Increase (Bakuton)",
    "details": "+2 Con, +1 Int"
  },
  {
    "clan": "Bakuton Clan",
    "title": "Speed (Bakuton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Skill Proficiencies (Bakuton)",
    "details": "Chakra Control, and your choice between Ninshou or Martial Arts."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Explosion Release Affinity",
    "details": "You begin with either Earth or Lightning Release Affinity. (Pick one)\n Bakuton Features"
  },
  {
    "clan": "Bakuton Clan",
    "title": "Explosive Techniques",
    "details": "The Bakuton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Branch Style",
    "details": "At 1st level, you realize which part of the Bakuton branch style you hail from. From time long\n immemorial the Bakuton blood split creating diverging family traits. You can learn Clan jutsu with the corresponding Branch style Keyword. This cannot be changed later on."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Artistic Style",
    "details": "One with the ability to mold clay, stone and other inorganic material into malleable catalyst for your Explosion Release given the title"
  },
  {
    "clan": "Bakuton Clan",
    "title": "Reckless Style",
    "details": "One with the ability to manipulate and create explosions on command within their physical reach, but at an increased potency."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Cataclysmic",
    "details": "Beginning at 1st level, Hijutsu you cast deals double damage to structures, constructs and objects. At 11th level, four times damage, and at 18th, six times damage."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Concussive Blasts",
    "details": "Beginning at 3rd level, your high ordinance blasts leave your enemies reeling. You gain a number of shrapnel Dice, which are d6’s equal to your proficiency bonus. When you would roll damage for a Bakuton clan Hijutsu, you can increase that damage by spending shrapnel die, up to your remaining amount, rolling the spent die and adding the result to the damage dealt. You regain spent die when you complete a short or long rest.\n Beginning at 7th level, you can add your Ninjutsu ability modifier to your Bakuton Hijutsu, if you did not already, twice per turn.\n Beginning at 11th level, your shrapnel die size increases by 1 step to a d8.\n Beginning at 15th level, you have learned to create more focused and compressed explosions. Whenever you would spend Shrapnel die to increase the damage of your Bakuton Hijutsu, the total damage ignores resistance and Damage reduction and you can choose one creature for each shrapnel die spent making them immune to your jutsu’s effect until the end of the current turn.\n Beginning at 18th level, whenever you roll an 8 or higher on your shrapnel die, you can roll that die again, adding the new roll to the previous roll as additional force damage. If you would roll the maximum amount again, you can repeat this process until you don’t roll the maximum."
  },
  {
    "clan": "Bakuton Clan",
    "title": "Explosion Release",
    "details": "The Bakuton clan has a unique talent for manifesting Explosion Release due to their close affinity to both Earth and Lightning Release. Beginning at 7th level you gain the second Nature release you didn’t select from Explosion Release Affinity clan trait and when casting a Bakuton Clan Hijutsu or Ninjutsu with the Earth or Lightning release keywords, you can change the damage type if any to force and increase the size of the area of effect by +15ft, if it has one."
  },
  {
    "clan": "Fuma Clan",
    "title": "Ability Score Increase (Fuma)",
    "details": "+2 Dex, +1 Wis"
  },
  {
    "clan": "Fuma Clan",
    "title": "Speed (Fuma)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Fuma Clan",
    "title": "Skill Proficiencies (Fuma)",
    "details": "Perception, Martial Arts"
  },
  {
    "clan": "Fuma Clan",
    "title": "Weapon Proficiencies (Fuma)",
    "details": "You are proficient with all simple and martial ranged weapons and ranged weapons with the Thrown property.\n Fuma Features"
  },
  {
    "clan": "Fuma Clan",
    "title": "House of Flying Daggers",
    "details": "The Fuma have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Fuma Clan",
    "title": "Specialized Tools",
    "details": "The Fuma may be known for their Shuriken but they are masters of all Ninja Tools. You may attach Paper Bombs to any weapon with the Thrown Keyword, not just Kunai. At 3rd Level, you may also attach Battle Wire to weapons with the Thrown property and give it the Returning Keyword and at 7th level, weapons you attach a Battle Wire to also gain the grapple property."
  },
  {
    "clan": "Fuma Clan",
    "title": "Immaculate Precision",
    "details": "Fuma Clansmen are known for their superior skill using throwing weapons. Beginning at 1st level, when making a ranged weapon attack or casting a Bukijutsu that requires ranged attacks you can use Dexterity in place of Strength for your Taijutsu Ability Modifier. Beginning at 3rd level, you increase the damage dice of Shuriken by +1. Fuma-Shuriken gain this bonus at 7th level and Monster Shuriken at 11th level. Additionally, Jutsu and effects that would multiply your [Weapons Damage] die by any amount, excluding critical hits, instead increases your damage die by an amount equal to the following; (Double: +1, Triple: +2, Quadruple: +3, Quintuple: +4, Sextuple: +5.)\n ."
  },
  {
    "clan": "Fuma Clan",
    "title": "Razor Sharp Senses",
    "details": "Fuma Clansmen are expected to predict the trajectory of an attack long before they even draw their weapon, allowing them to bounce attacks off of unsuspecting surfaces. Beginning at 3rd level, twice per short rest, when you would miss a ranged weapon, or taijutsu attack that uses a weapon with the Thrown Property, you can remake the attack roll, taking the second result."
  },
  {
    "clan": "Fuma Clan",
    "title": "Working the Angles",
    "details": "Beginning at 7th level, attacks you make with ranged weapons or weapons with the thrown property using your Attack action can become a Trick Shot, up to twice per turn and weapons with the returning property can be returned to you at any range.\n Trick Shot. A trick shot is a ranged weapon attack that can originate from any point within the weapons range as it bounces off of different surface. This attack ignores cover."
  },
  {
    "clan": "Fuma Clan",
    "title": "Lethal precision (Fuma)",
    "details": "Fuma are rarely known for their lack of accuracy. Beginning at 11th level, weapons with the Thrown property gain +1 rank(s) of the Critical and Lethal property. This increases to +2 of each at 18th level."
  },
  {
    "clan": "Futton Clan",
    "title": "Ability Score Increase (Futton)",
    "details": "+2 Int or Str, +1 Con"
  },
  {
    "clan": "Futton Clan",
    "title": "Speed (Futton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Futton Clan",
    "title": "Skill Proficiencies (Futton)",
    "details": "Martial Arts, and your choice between Ninshou or Athletics."
  },
  {
    "clan": "Futton Clan",
    "title": "Boil Release Affinity",
    "details": "You begin with either Water or Fire Release Affinity. (Pick one)\n Futton Features"
  },
  {
    "clan": "Futton Clan",
    "title": "Corrosive Techniques",
    "details": "The Futton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Futton Clan",
    "title": "Boil Over",
    "details": "Beginning at 1st level, Jutsu you cast that deals acid damage gain a +2 bonus to the damage they deal. This becomes +4 at 11th level and +6 at 18th. This bonus damage happens twice per casting."
  },
  {
    "clan": "Futton Clan",
    "title": "Corrosive Pressure",
    "details": "Beginning at 1st level, your highly corrosive chakra has the ability to melt through almost anything. You can learn Jutsu that deals Acid damage or inflicts the corroded Condition. Additionally, when you would deal Acid damage to a construct or structure you ignore any DR (damage reduction) it has, if any. Starting at 11th level, this pressure enables Futton clan Hijutsu you cast that to ignore resistance to the damage it deals. Beginning at 18th level, Futton clan hijutsu you cast, treats immunity as a resistance."
  },
  {
    "clan": "Futton Clan",
    "title": "Corrosive Aura",
    "details": "Beginning at 3rd level, your highly corrosive chakra has the ability to melt through almost anything. When you would deal Acid damage to a creature who has a bonus to their AC as a result of a Jutsu or feature that costs chakra, you deal additional damage equal to twice your proficiency bonus. At 11th level, this aura extends to all Boil Release Jutsu you would cast. Futton Clan Hijutsu you cast that deals Acid Damage ignores Resistance. This increases to Immunity beginning at 18th level."
  },
  {
    "clan": "Futton Clan",
    "title": "Boiling Chakra",
    "details": "Beginning at 3rd level, you have learned how to boil your chakra in distinct ways. You gain a pool of Boil points which you use to fuel the following abilities. You have a number of Boil Points equal to your proficiency bonus that refreshes on a long rest. You can spend 1 boil point as a bonus action to accomplish any of the following effects."
  },
  {
    "clan": "Futton Clan",
    "title": "Boiling Body",
    "details": "Gain a +4 DR bonus vs incoming damage until the beginning of your next turn. This bonus becomes +8 vs Fire, Wind or Cold damage. This bonus increases to +6 and +10 respectively at 11th level.\n Boiling Might. Gain a +2 bonus to melee Taijutsu attacks and a +2 bonus to all Ability and Skill checks that require Strength until the beginning of your next turn. Both of these bonuses increases to +3 at 11th level.\n Boiling Power. Increase the damage of the next jutsu a willing creature (excluding yourself) within 15 feet of you cast by +2d12 acid damage. This bonus increases to 4d12 at 11th level."
  },
  {
    "clan": "Futton Clan",
    "title": "Boiling Mind",
    "details": "The next Jutsu you cast with the Fire or Water Release keyword(s) has its cost reduced by an amount equal to half of your proficiency bonus.\n Boiling Force. A creature you deal damage to with ranks of corroded loses all sources of resistance until the beginning of your next turn. Beginning at 11th level you can instead choose to make them lose immunity to one source of damage for the same duration of your choice.\n Boiling Focus. You can touch a willing creature (other than yourself). When you do, their chakra begins to boil over granting them a surge of strength. Until the beginning of your next turn, they cannot lose concentration on jutsu they cast as a result of damage. This bonus can be applied to up to two willing creatures, including yourself at 11th level."
  },
  {
    "clan": "Futton Clan",
    "title": "Boil Release",
    "details": "The Futton clan has a unique talent for manifesting Boil Release due to their close affinity to both Fire and Water Release. Beginning at 7th level you gain the second Nature release you didn’t select from Boil Release Affinity clan trait and can learn Ninjutsu that deals Acid damage. Also, at 7th level, when casting a jutsu with either Fire or Water release keywords, creatures you damage lose all of their temporary hit points before proceeding with damage calculations. Additionally, you can change the damage type of jutsu you cast with the Fire or Water release keywords, if any to Acid. When you would reach 11th level, your Boil release, can evolve a creature corroded condition to a new level, called Deteriorate. When a creature with 5 ranks of the corroded condition would gain another rank of the corroded condition, the instead begin to Deteriorate, losing all ranks of corroded as it is replaced with 1 rank of Deteriorate. A Deteriorating creature suffers the following effects.\n A Deteriorating creature is counted as having 5 ranks of corroded for the purposes of interacting with feature, traits and jutsu and cannot gain ranks of the Corroded condition while they are Deteriorating.\n A Deteriorating creature gains a -10 penalty to its DR (Damage reduction) and cannot gain additional DR for the duration.\n A Deteriorating creature gains a -5 penalty to all Constitution based checks and saves.\n A Deteriorating creature loses all Resistances it has for the duration.\n A Deteriorating creature can spend a Full-Turn action in an attempt to clean the broiling chakra from themselves, by making a DC 23 Dexterity saving throw to cleanse themselves."
  },
  {
    "clan": "Hatake Clan",
    "title": "Ability Score Increase (Hatake)",
    "details": "+2 Int, +1 Cha"
  },
  {
    "clan": "Hatake Clan",
    "title": "Speed (Hatake)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Hatake Clan",
    "title": "Skill Proficiencies (Hatake)",
    "details": "Ninshou, Perception"
  },
  {
    "clan": "Hatake Clan",
    "title": "Passive Affinity (Hatake)",
    "details": "You have Lightning Release Affinity (You can learn Ninjutsu with the Lightning Release Keyword)"
  },
  {
    "clan": "Hatake Clan",
    "title": "Lightning Literacy",
    "details": "You reduce the ability score requirement to learn and cast Jutsu with the Lightning Release keyword by 2. For Ability score requirements, check the SHB, pg.121).\n Hatake Features"
  },
  {
    "clan": "Hatake Clan",
    "title": "White Chakra",
    "details": "The Hatake Clan are extremely proficient Chakra molders. They innately have the ability to call upon a unique source of Chakra called White Chakra. Beginning at 1st level, you have 5 White Chakra which you can only spend on Jutsu with the Lightning Release keyword. You gain 1 White chakra every level. When you finish a short rest you regain half of your spent white chakra. Your White chakra pool is fully refilled on a long rest."
  },
  {
    "clan": "Hatake Clan",
    "title": "Lightning Release Simplicity",
    "details": "Beginning at 1st level. When creating or learning Ninjutsu with the Lightning Release Affinity, reduce the time it takes to complete the task by half."
  },
  {
    "clan": "Hatake Clan",
    "title": "Lightning Release Adept",
    "details": "Also, at 3rd level, reduce the cost of ninjutsu with the Lightning Release Keyword by an amount equal to the Rank of the jutsu cast. (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5). If you would spend at least 1 White chakra, this cost reduction per rank instead becomes the following. (D-Rank: 2, C-Rank: 3, B-Rank: 4, A-Rank: 5, S-Rank: 6). If another effect would reduce the cost of a jutsu you cast as a result of its rank, the cost reduction effects, do not stack. Starting at 7th level, your skill with lightning Release has grown to a considerable degree. When you could cast a Jutsu with the lightning release keyword and an Overcharge effect, you can choose to spend an amount of White chakra equal to its rank to fulfill the Overcharge requirements to gain their effects. (D-Rank/C-Rank: 1 White Chakra (WC), B-Rank/A-Rank: 2 WC, S-Rank: 3 WC)"
  },
  {
    "clan": "Hatake Clan",
    "title": "White Lightning",
    "details": "Beginning at 7th level, when you would cast a Ninjutsu with the Lightning Release Keyword that deals damage by spending a certain amount of White Chakra based on the rank of the jutsu used, you increase the number of damage die by +1 for this Jutsu's casting. This damage die bonus increases to +2 at 15th level. (D-Rank/C-Rank: 1 White Chakra (WC), B-Rank/A-Rank: 2 WC, S-Rank: 3 WC) \nAlso, at 7th level, when you would cast a jutsu without the Lightning Release keyword, you may spend a number of white chakra equal to its rank (D-Rank 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5). When you do, the jutsu cast gains the lightning release keyword, its damage type becomes lightning and increases its damage die by +1.\n Beginning at 11th level, once per turn, when you would deal damage to a creature, you can deal additional lightning damage equal to your proficiency bonus."
  },
  {
    "clan": "Hebi Clan",
    "title": "Ability Score Increase (Hebi)",
    "details": "+2 Str or Dex, +1 Con"
  },
  {
    "clan": "Hebi Clan",
    "title": "Speed (Hebi)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Hebi Clan",
    "title": "Skill Proficiencies (Hebi)",
    "details": "Survival, Animal Handling"
  },
  {
    "clan": "Hebi Clan",
    "title": "Weapon Proficiencies (Hebi)",
    "details": "You are proficient with Katana’s, Broadswords and Odachi’s.\n Tool Proficiencies: Poisoner’s Kit.\n Hebi Features"
  },
  {
    "clan": "Hebi Clan",
    "title": "Hebi Clan Jutsu",
    "details": "The Hebi have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Hebi Clan",
    "title": "Snake Speech",
    "details": "Hebi Clansmen are known for their affinity with snakes of all types. Due to their connection with these reptiles over generations, you can communicate with and understand snakes of any breed."
  },
  {
    "clan": "Hebi Clan",
    "title": "Serpent Mimicry",
    "details": "Beginning at 1st level, your heritage and history with snakes grants you enhanced senses, similar to theirs. You have Darkvision up to 60 feet and Tremor sense up to 30 feet.\n Beginning at 11th level, you have learned to use your connected heritage to increase your ability to stalk your prey. Dexterity (Stealth) Checks made in natural environments such as forests, woods, and tundra’s are always made at advantage."
  },
  {
    "clan": "Hebi Clan",
    "title": "Poisonous Diet",
    "details": "The Hebi clan feeds its young micro doses of some of the most potent venoms, poisons and toxins in the known world, enhancing their resilience towards it. Beginning at 1st level, you have a +2 bonus to saving throws to resist Poison damage or the Envenomed condition. This increases to +4 at 11th level and starting at 18th level, you gain immunity to Poison damage and the envenomed condition."
  },
  {
    "clan": "Hebi Clan",
    "title": "Regeneration",
    "details": "You have learned to tap into your clan’s innate ability to enhance its self-regeneration. Beginning at 1st level you can as a bonus action begin to focus on your accelerated regeneration, regaining 1d8+Half your level in hit points. This increases to 2d8+Half your level at 7th and 3d8 + Half your level at 15th. You can regain hit points in this way twice per rest."
  },
  {
    "clan": "Hebi Clan",
    "title": "Poison Potency",
    "details": "The Hebi clans’ rituals, have been ingrained into you, enhancing your knowledge of poisons and their potency when you use them. Beginning at 3rd level, you have learned to coat your weapons in a potent poison. As a bonus action you coat a weapon you are holding in a type of poison known as the Vipers Venom. For the next minute your [Weapons Damage] type becomes Poison and twice per turn your weapon deals a bonus +1d4 damage. This increases to +1d6 at 11th, and +1d8 at 18th. You can coat a weapon in poison this way twice per rest and a weapon coated in this way ignores resistance to Poison damage and still counts as its original damage type for the purpose of qualifying for Bukijutsu. Beginning at 7th level, when you deal poison damage to a creature when you roll your [Weapon Damage] or using Hebi Clan Hijutsu, the affected creature reduces all hit points gained by half until the end of their next turn."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Ability Score Increase (Hozuki)",
    "details": "+2 Str, +1 Int"
  },
  {
    "clan": "Hozuki Clan",
    "title": "Speed (Hozuki)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Skill Proficiencies (Hozuki)",
    "details": "Martial Arts, Chakra Control."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Water Release Affinity",
    "details": "You begin with the Water Release affinity (You can learn Ninjutsu with the Water Release Keyword.)"
  },
  {
    "clan": "Hozuki Clan",
    "title": "Lightning Release Inability",
    "details": "You cannot use or Learn Ninjutsu with the Lightning Release Keyword\n Hozuki Features"
  },
  {
    "clan": "Hozuki Clan",
    "title": "Hozuki Techniques",
    "details": "The Hozuki Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Amphibious (Hozuki)",
    "details": "You can breathe air and Water."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Water Dependency",
    "details": "The Hozuki has a dependency on Water, they must consume at least a gallon of Water or immerse themselves in Water for one hour each day. If the Hozuki fails to do this they suffer 1 level of exhaustion at the end of that day. The Hozuki, can recover from this exhaustion by drinking a gallon of Water or immersing yourself in Water for at least 1 hour."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Made of Water",
    "details": "Starting at 1st level, your body counts as a sufficient source of Water to reduce the cost of Water release Jutsu (You cannot gain the alternative effect of a Water Release Jutsu using this feature). If the Jutsu cast cannot have its cost reduced by having a sufficient source of Water, you instead reduce the cost of ninjutsu with the Water Release Keyword by an amount equal to the Rank of the jutsu cast. (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5)."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Water Reservoirs",
    "details": "Beginning at 3rd level, you store extra Water in your body, giving you an amount of uses equal to your proficiency bonus per long rest. You can use these reservoirs to empower a ninjutsu with the Water Release Keyword, either increases its damage by 1 damage die or save DC by +1. At 11th level, increase the damage die or save DC by 2 and at 18th level, increase the damage die or save DC by 3."
  },
  {
    "clan": "Hozuki Clan",
    "title": "Reflective Surface",
    "details": "Beginning at 7th level, whenever you cast a Ninjutsu with the Water Release Keyword, gain an amount of Temporary Hit points equal to the rank of jutsu used, until the beginning of your next turn. (D-Rank: 3, C-Rank: 6, B-Rank: 10, A-Rank: 15, S-Rank: 20). When you reach 15th level the amount of temporary hit points gained becomes the following; (D-Rank 5, C-Rank: 10, B-Rank: 15, A-Rank: 20, S-Rank: 25)"
  },
  {
    "clan": "Hyūga Clan",
    "title": "The clan is separated into two parts",
    "details": "the main house and the branch house, a system that protects the secrets of the Byakugan from outsiders. The main house runs the family while the branch house protects it.\n Hyūga Traits"
  },
  {
    "clan": "Hyūga Clan",
    "title": "Ability Score Increase (Hyūga)",
    "details": "+2 Wis, +1 Dex"
  },
  {
    "clan": "Hyūga Clan",
    "title": "Speed (Hyūga)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Skill Proficiencies (Hyūga)",
    "details": "Perception, Insight"
  },
  {
    "clan": "Hyūga Clan",
    "title": "Dark Vision",
    "details": "Even without the power of a fully active Byakugan, you have Darkvision up to 30 feet."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Hyūga Hijutsu",
    "details": "You know 1 additional Hyūga Clan D-Rank Jutsu, this does not count against your jutsu known.\n Hyūga Features"
  },
  {
    "clan": "Hyūga Clan",
    "title": "Hyūga Clan Jutsu",
    "details": "The Hyūga Have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list. You can only Add these Jutsu to your list as long as you are from the correct branch within the clan Unless it does not have any restrictive keywords.\n  Branch Family: At first Level, choose which part of the Hyūga Family you reign from. This cannot be changed later on."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Main House",
    "details": "The Head portion of the family considered the “royal” part of the clan overall. This Portion of the clan Focuses on the Hyūga clan’s secret techniques. If you select this branch of the family, you will have access to the main house’s Hyūga clan techniques. This is due to the fact, most main branch Hyuga’s do not become ninjas or shinobi in the classical sense instead becoming staff in the Villages information council."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Side House",
    "details": "The guardian/protector portion of the Hyūga clan. They are generally made to be like servants to the main house while inside the Hyūga villa. While not given access to the entirety of the Hyūga clan’s secret techniques, they have formulated their own advanced versions of the general gentle fist and 8 trigram techniques."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Byakugan",
    "details": "One of the hidden Leaf village’s 2 great dojutsu. The Byakugan is an eye of extreme refined focus. At 1st level you can spend 5 Chakra to activate the Byakugan as a bonus action which remains active for up to 1 hour. You may deactivate and reactivate the Byakugan during this time period with no additional cost. While active the Byakugan gains the following benefits:"
  },
  {
    "clan": "Hyūga Clan",
    "title": "All Seeing White Eye",
    "details": "You have 500 feet of Chakra sight while out of combat and half of that, while in combat. You gain the ability to see a creature’s Chakra nature, if any. You can see through material up to 10 feet thick. creatures cannot be obscured to you in any way if you can see through the obstruction."
  },
  {
    "clan": "Hyūga Clan",
    "title": "360° Vision",
    "details": "You can see in a 360-degree field around you up to half your Chakra sight range, originating from you in combat. While out of combat, your field of vision increases to match your Chakra sight range. You can see without having to turn your head or avert your eyes.\n At 3rd Level, while training with your Byakugan, you gain one of the following additional features that further exemplify your skill with the Dojutsu. At 11th and 18th Level you may select an additional feature from this list."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Combat Insight",
    "details": "You gain amazing combat senses while your Byakugan is active. If you are proficient in Dexterity saving throws you gain a +2 bonus to them. If you are not proficient, you gain a +1 bonus instead."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Combative Vision",
    "details": "You also add your Wisdom ability modifier to the first unarmed attack roll, using the Gentle Fist Stance, you make on each of your turns."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Immense Distance",
    "details": "Doubles the range of Chakra sight to 1,000ft. You can see things up to 1 mile away as if they were within 50 feet of you."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Penetrative Vision",
    "details": "You can see through obstructions up to 30 feet thick within your Chakra sight range. You gain a +2 bonus to Perception while your Byakugan is active."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Perceptive Insight",
    "details": "You can discern a creature from any clones they may make, regardless of the clone used. Additionally, you gain advantage on checks made with the See through lies skill-action."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Perceptive Predictions",
    "details": "You gain unmatched predictive combat senses. When you would cast a Hyūga Hijutsu as a reaction to taking damage, the jutsu gains a bonus 4 DR, based on the rank it is cast for the duration for the jutsu. (D-Rank/C-Rank: 4 DR, B-Rank/A-Rank: 8 DR, S-Rank: 12 DR)."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Perceptive Resilience",
    "details": "Increase your resistance to misdirection. When making a Wisdom saving throw against Genjutsu with the Visual Keyword, you gain a +2 bonus if you are proficient in Wisdom saving throws. If you are not proficient you gain a +1 bonus instead. These saves cannot be made at disadvantage."
  },
  {
    "clan": "Hyūga Clan",
    "title": "Gentle Fist Stance",
    "details": "The Gentle Fist is the premiere fighting style for the Hyūga clan. Starting at a young age, both main and side branch clansmen are trained in this art of Taijutsu. The primary focus is on injecting chakra into an opponent’s chakra network disrupting the flow of a creature's chakra network.\n Beginning at 1st level, you can use Dexterity instead of Strength while in this stance, for the attack and damage rolls of unarmed strikes and Hyūga Clan Taijutsu attack rolls and Save DC’s calculations.\n Also, at 1st level your [Unarmed Damage] becomes a d6 and deals chakra damage. This becomes 2d6 at 7th level and a 3d6 at 11th level. When you deal chakra damage to a creature with 0 chakra, you instead deal an equal amount of force damage to their hit points. Alternatively, you can choose to deal bludgeoning damage to a creatures in this stance, if you do, your damage die is 1d6. You deal half damage to constructs and undead while in this stance.\n Starting at 3rd level, while in this stance, once per turn, when you would increase the cost of a hostile creatures jutsu, you may add 1d4 to the cost increase. This increases to 1d6 at 111th level and 1d8 at 18th.\n Beginning at 7th level if you deal Chakra damage with this stance and the target has 0 Chakra, you instead deal double force damage to the targets hit points.\n ."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Ability Score Increase (Inuzuka)",
    "details": "+2 Str or Dex, +1 Wis"
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Speed (Inuzuka)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Skill Proficiencies (Inuzuka)",
    "details": "Animal Handling, Acrobatics"
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Extra Language (Inuzuka)",
    "details": "Dog-Speak, you can speak to & understand canine creatures."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Inuzuka Hijutsu",
    "details": "You Nin-Dog knows 1 Inuzuka Clan D-Rank Jutsu, that you do not need to add to your known jutsu list.\n Inuzuka Features"
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Inuzuka Clan Jutsu",
    "details": "The Inuzuka have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Beast Master",
    "details": "Starting at 1st level you have a canine companion raised and bred by the Inuzuka clan known as a Nin-Dog. Your Nin-Dog possesses the same statistics as a Dog/Wolf summon of D-Rank. When the Nin-Dog would reach levels 8, 12, 16 and 20 it would become the associated rank, gain 1 new Special feature of the appropriate rank and increase its Jutsu slots to the listed value. Your Nin-Dog mechanics are as follows;\n Shares your level\n Proficient in all saving throws\n Cannot learn jutsu like a Dog/Wolf summon, instead knowing all Inuzuka Clan Hijutsu you know.\n Your Nin-Dogs Toughness is 10 \nYou calculated your Nin-Dogs AC as follows 12+Half Nin-Dogs Level + Nin-Dogs Defensive Ability score.\n At levels 4, 8, 12, 16 and 20 your Nin-Dog gains +8 ability score increases following its associated max ability score with its rank as seen in the Dog/Wolf summon table.\n Your Nin-Dogs size begins as small, grows to medium when it reaches 8th level and grows to Large at 12th.\n Your Nin-Dog regain half of their spent Jutsu Slots on a short rest and all of their spent slots on a long rest.\n If your Nin-Dog spends all of its Jutsu Slots, it does not vanish or become unsummoned like a normal summoned creature.\n Finally, Unlike Dog/Wolf summons, Nin-Dogs cannot have the listed Roles in the Dog/Wolf summon page. They Instead treat their breed as their Role.\n Choose between one of the following breeds. Your Nin-Dog gains the chosen breed as its Role;"
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Young Inuit",
    "details": "A breed known for its hunting skill. This Nin-Dog gains the following;\n Proficiency in Investigation and Stealth.\n Expertise in Perception.\n +10 increase to their speed and ignores difficult terrain.\n This breed can either Dash or Disengage at no action cost, once per round as part of one of their commands.\n Beginning at 11th level, your Nin-Dog gains the benefits of your Wild Sense feature."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Young Kugsha",
    "details": "A breed known for its combat skill. This Nin-Dog gains the following;\n Proficiency in Acrobatics and Martial Arts.\n Expertise in Athletics."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Multiattack",
    "details": "You can make up to two attacks using your Bite. Bite attacks add your Dexterity to damage rolls once per turn.\n Gains +1 additional D-Rank Dog/Wolf special features.\n Beginning at 11th level, Gains +1 additional Dog/Wolf special feature of either D or C-Rank."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Young Tamaskan",
    "details": "A breed known for its ability to mold Chakra. This Nin-Dog gains the following;\n Proficiency in Chakra control and Ninshou.\n Expertise in Insight..\n Learns 1 Jutsu of D-Rank following the Dog/Wolf Jutsu specialty limits\n The first jutsu your Nin-Dog casts per short rest, does not spend a Jutsu Slot.\n Beginning at 11th level, this Nin-Dog learns 1 C-Rank jutsu following the Dog/Wolf Jutsu specialty limits\n In the event you are incapacitated or absent, your Nin-Dog acts on their own based on how you've commanded them before, considering your allies, its allies, and will follow them until you cross paths again. If your Nin- Dog is alone, they will perform the Search skill action until they find you. If your Nin-Dog dies, you can spend 1 week of downtime with your clan training another Nin-Dog.\n Starting at 18th level, you and your Nin-Dog have bonded in such a way where there is no need to verbally communicate. It continues to act on your turn as normal, but no longer requires a bonus action to command."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Feral Ability",
    "details": "Beginning at 1st level you specialize in a quick, fast and feral fighting style to better synergize with your canine companion. You can use Dexterity as your Taijutsu ability modifier for Inuzuka clan Jutsu."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Wild Sense",
    "details": "Beginning at 3rd level, you have learned to imitate your Nin-Dogs nasal and auditory senses with Chakra. You gain a +2 bonus to checks made with the Search, Sense Motive and Sense Direction skill actions. This bonus becomes +4 at 11th level and +6 at 18th level."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Savage Attack",
    "details": "Beginning at 3rd level, you and your Nin-Dog carry within them the savage fighting spirit of the Inuzuka. When you and your Nin-Dog are on opposite sides of a creatures, the first attack roll either of you make is at advantage, once per turn.\n Starting at 7th level, when either you or your Nin-Dog scores a critical hit, you deal an additional die of damage. If this critical hit was scored with an Inuzuka Clan jutsu, you can deal two additional die of damage.\n Beginning at 15th level, when either you or your Nin-Dog damage a bloodied (Under 50% hit points) creature, with an unarmed strike, weapon attack, or Inuzuka clan jutsu, you increase the damage die by 1 step."
  },
  {
    "clan": "Inuzuka Clan",
    "title": "Bestial Fury",
    "details": "Beginning at 11th level, you gain expertise on initiative checks. When you would roll for initiative, you or your Nin-Dog can cast an Inuzuka Clan jutsu as part of rolling for initiative, ignoring the Jutsu’s listed casting time, but only one of you can do this. The jutsu cast cannot target an allied or hostile creature aside from you or your Nin-Dog.\n Finally at 18th level, when either you or your Nin-Dog casts an Inuzuka Clan jutsu and the other has not acted, the other can use their reaction to cast the same Inuzuka clan jutsu targeting the same creature."
  },
  {
    "clan": "Jiton Clan",
    "title": "Ability Score Increase (Jiton)",
    "details": "+2 Int, +1 Con"
  },
  {
    "clan": "Jiton Clan",
    "title": "Speed (Jiton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Jiton Clan",
    "title": "Skill Proficiencies (Jiton)",
    "details": "Ninshou, Survival."
  },
  {
    "clan": "Jiton Clan",
    "title": "Magnet Release Affinity",
    "details": "You begin with either Earth or Wind Release Affinity. (Pick one)\n Jiton Features"
  },
  {
    "clan": "Jiton Clan",
    "title": "Magnet Techniques",
    "details": "The Jiton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Jiton Clan",
    "title": "Dust Layer",
    "details": "Beginning at 1st level, the first time each turn you deal earth damage with a Hijutsu you cast, it coats the target in a thin layer of dust, imposing a -1 Penalty to checks and saving throws made to resist Jutsu with the Earth Release Keyword until the end of your next turn. This penalty does not stack. Beginning at 11th level, this penalty can stack up to 2 times, and each application resets its duration. Finally at 18th level this penalty can stack up to 3 times and each application resets its duration."
  },
  {
    "clan": "Jiton Clan",
    "title": "Magnet Release",
    "details": "The Jiton clan has a unique talent for manifesting Magnet Release due to their close affinity to both Earth and Wind Release. Beginning at 7th level you gain the second Nature release you didn’t select from Magnet Release Affinity clan trait. Also, at 7th level, twice per turn, when casting a jutsu with either Earth or Wind Release keywords, you can change the damage type to earth and increase the damage die by 1 step, up to a maximum of D12. (D4>D6>D8>D10>D12)."
  },
  {
    "clan": "Jiton Clan",
    "title": "Magnetic Mark",
    "details": "Using their abilities often, Jiton clan members develop a natural magnetic field that they can use offensively or defensively. Beginning at 3rd level, when you would affect another creature with any of your Jiton clan Hijutsu, you mark that creature until the end of your next turn. While the creature is marked by you, you always know their location, and the creature cannot benefit from being hidden from you. While the marked creature is within 60 feet of you, if another creature (including you) misses it with an attack made with a metal weapon, or the target succeeds on a saving throw against any Jiton clan Hijutsu, once per turn you can spend your reaction to allow the creature to reroll the attack roll, or force the target to reroll their saving throw.\n At 7th level, if a marked creature hits you or a creature you can see within 5 feet of you with an attack, you can spend your reaction to impose a 1d6 penalty to triggering creatures attack roll. If the attack still hits, the target gains resistance to the triggering attack's damage. At 15th level, the penalty increases to 1d10."
  },
  {
    "clan": "Jiton Clan",
    "title": "Swirling Currents",
    "details": "Also at 3rd level, your magnetic field constantly slows metal objects thrown or fired at you. You have resistance to bludgeoning, piercing, or slashing damage from ranged weapons. You select which one of these damage types each time you complete a long rest. At 11th level, you have resistance to all three damage types from ranged weapon attacks. At 18th level, your magnetic field has grown strong enough that you have a natural resistance to all bludgeoning, piercing, or slashing damage. Additionally, each time you complete a rest, select a damage type between wind or earth. You gain resistance to the chosen damage type until you complete a rest."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Ability Score Increase (Jūgo)",
    "details": "+2 Str, +1 Con"
  },
  {
    "clan": "Jūgo Clan",
    "title": "Speed (Jūgo)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Skill Proficiencies (Jūgo)",
    "details": "Athletics, Acrobatics."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Jugo Hijutsu",
    "details": "You know 1 additional Jugo Clan D-Rank Jutsu, this does not count against your Jutsu known.\n JŪGO Features"
  },
  {
    "clan": "Jūgo Clan",
    "title": "Raw Chakra Techniques",
    "details": "The Jugo Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Nature’s Brute",
    "details": "You can use Strength in place of Intelligence for Jugo clan Ninjutsu."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Raw Chakra",
    "details": "Starting at 1st level, you gain an amount of Raw Chakra die, equal to your proficiency bonus. Raw Chakra die are d4’s and you can spend any amount when using the following effects. Beginning at 7th and 11th levels the size of your Raw Chakra dice increase to a d6 and d8, respectively. You regain half your spend Raw Chakra die on a short rest, and all on a long rest;\n Amplify. When you make a melee attack, Taijutsu attack, or cast a Jugo Clan Ninjutsu, you may add Raw Chakra die to the damage roll.\n Absorb. As an action, you can attempt to absorb a creature chakra you can reach. Target creature must make a Constitution Saving throw vs your Ninjutsu Save DC as if you were casting a Jugo Clan Ninjutsu. On a failed save, spend any number of remaining Raw Chakra die. They take chakra damage equal to twice the result, and you gain temporary chakra equal to the chakra damage dealt.\n Reduce. As part of casting a Taijutsu or Jugo Clan Hijutsu, you may spend one Raw Chakra die. Reduce the cost of the jutsu cast by half the result.\n Heal. As an action, you may heal yourself or allies with Raw Chakra. Spend a number of Raw Chakra die either yourself or an allied creature you can reach, regains hit points equal to the result."
  },
  {
    "clan": "Jūgo Clan",
    "title": "Raw Chakra Form",
    "details": "Starting at 3rd level, you can warp Raw Chakra to alter your body temporarily, allowing you to tap into a Raw, unfocused and untamed version of Sage Mode. Your Raw Chakra Form turns your skin gray, and enhances your strength, speed, and durability. You may enter this form as an Action, twice per long rest, for up to 1 minute. You can transform an additional time per long rest at 11th and 18th levels. For its duration you gain the following benefits;\n When making a Strength Ability check or saving throw, add 1d4. This becomes a d6 at 11th level.\n As a part of transforming and entering your Raw Chakra Form, you gain Temporary hit points equal to twice your character level. Beginning at 7th level, when you transform you can spend Raw Chakra die to gain additional temporary hit points equal to twice the result. This cannot be done after transforming.\n Your unarmed damage die becomes 1d8 unless already higher. If it is higher, increase the die size by 1 step. (1d10>1d12). Also, your unarmed strikes are chakra enhanced.\n Your Jugo clan Hijutsu do not cost chakra to maintain concentration, unless otherwise stated.\n Your Jutsu Clan Hijutsu lose any Hand sign (HS) component.\n Your speed increases by 5ft. This bonuses increases to 10ft at 7th, and 15ft at 15th.\n Beginning at 11th level, when initiative is rolled, by spending 1 Raw Chakra die, you may transform immediately as a part of your initiative roll while adding the result to the initiative check. You do not gain this benefit while surprised.\n At 18th level, you cannot be moved by a hostile effect, by any means.\n At 18th level, you are immune to the Slowed, and weakened conditions."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Ability Score Increase (Kaguya)",
    "details": "+2 Str or Dex (pick one), +1 Con"
  },
  {
    "clan": "Kaguya Clan",
    "title": "Speed (Kaguya)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Skill Proficiencies (Kaguya)",
    "details": "Athletics, Martial Arts\n Kaguya Features"
  },
  {
    "clan": "Kaguya Clan",
    "title": "Dead Bone Pulse",
    "details": "The Kaguya clan possess the Shikotsumyaku (Dead Bone Pulse) blood line trait allowing them to manipulate their bone structure. The Kaguya have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Bone Weapons",
    "details": "The Kaguya clan are known for their amazing Taijutsu prowess when using their ability to manipulate their bone structures to create weapons. Bone Weapons are unique in their structure and make up. All Bone Weapons have the Light and Finesse weapon properties if they did not already have them. When creating or learning Bukijutsu with the Hijutsu keyword, reduce the time it takes to complete the task by half. You are proficient with all Bone Weapons you conjure with this feature.\n Beginning at 1st Level, as a bonus action you can eject some of your bones in your body to create a Bone Weapon. Using your bones, you can create any simple melee weapon. Beginning, at 7th level you have mastered your bone structure manipulation. You can create far more complex weapons. You can create any martial melee weapon of your choice so long as that weapon does not have the Heavy weapon property. Beginning at 11th level, this extends to even uniquely rare weapons. You can create any exotic melee weapon of your choice so long as that weapon does not have the Heavy weapon property."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Shikotsumyaku Stance",
    "details": "The Shikotsumyaku Stance is the primary fighting style for the Kaguya clan which trains their young ruthlessly to utilize their unique physiology. Beginning at 1st Level, while in this stance you can use Dexterity as your Taijutsu ability modifier for your Kaguya Clan Hijutsu and Bone Weapons you use while in this stance have its damage die increased one step higher than the weapon they are imitating (Ex. A Bone Short Sword deals 1d8, instead of 1d6).\n Beginning at 3rd level, hostile creatures who would cast a Jutsu that requires hand signs (HS) within your weapons range, triggers an attack of opportunity. A creature whom you deal [Weapon Damage] to as a result of an attack of opportunity, must make a Strength saving throw vs your Taijutsu save DC. On a failed save they are knocked prone and have their movement speed reduced by half, until the end of the current turn.\n Beginning at 7th level once per casting, when you make a taijutsu attack as a result of a Kaguya clan Hijutsu you gain +10 movement speed. For each creature you successfully score a hit against with these taijutsu attacks, you gain a +1 bonus to your AC, until the beginning of your next turn, up to a maximum of +2.\n Beginning at 11th level, when you would cast the Dance of the Willow Kaguya clan Hijutsu as a Reaction to taking damage, its cost is reduced by -2. Each time it is cast after the first each turn; Its cost is reduced by and additional -2 down to a minimum of 0. Finally, each time the jutsu is cast per turn, you may make one additional attack targeting another hostile creature other than the one who triggered the jutsu’s casting.\n Beginning at 15th level, each time you would cast the Dance of the Willow Kaguya clan Hijutsu per turn, you gain +4 Damage reduction vs the triggering creature until the end of turn you cast it.\n Beginning at 18th level, the first time each turn you cast a Kaguya clan Hijutsu, you gain a number of temporary hit points equal to half of its chakra cost, until the beginning of your next turn."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Battle Hunger",
    "details": "The Kaguya clan are known for their bloodlust in battle constant battles have awakened this from within you. Beginning at 11th level, you have learned to tap into the lust for battle, blacking out your thoughts, entering a state of known to the Kaguya as your Lust for Battle. You remain in this state for 1 minute, until you are incapacitated, knocked unconscious, are calmed down in some other way or spend a bonus action to end this status. Once you use this feature, you cannot do so again until you finish a rest."
  },
  {
    "clan": "Kaguya Clan",
    "title": "Calcified Structure",
    "details": "The Kaguya clan were known for their alien and almost foreign bone and body structure, making it exceedingly difficult to truly know how any Kaguya functioned as they were all unique and different in their own way. Beginning at 3rd level, this unique trait materializes within you. Whenever you would make a saving throw against a hostile creature using a Jutsu with the Medical or Inhaled keywords you gain a +2 bonus to the result. This bonus is further increased to+4 at 11th. Beginning at 15th level When you would pass a saving throw vs a jutsu with the Medical or Inhaled keywords, you instead suffer no effects."
  },
  {
    "clan": "Kurama Clan",
    "title": "Ability Score Increase (Kurama)",
    "details": "+2 Wis or Cha, +1 Int"
  },
  {
    "clan": "Kurama Clan",
    "title": "Speed (Kurama)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Kurama Clan",
    "title": "Skill Proficiencies (Kurama)",
    "details": "Illusions, Insight"
  },
  {
    "clan": "Kurama Clan",
    "title": "Genjutsu Literacy",
    "details": "You reduce the ability score requirement to learn and cast Genjutsu by 2. For Ability score requirements, check the SHB, pg.121).\n Kurama Features"
  },
  {
    "clan": "Kurama Clan",
    "title": "Genjutsu Specialty",
    "details": "Beginning at 1st level, your ability with Genjutsu easily eclipses others within the same field of expertise. When you would cast a Genjutsu that requires concentration. You reduce the cost to maintain all Genjutsu by an amount equal to their rank (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5.). Your genjutsu concentration costs can be reduced to 0, regardless of what other features dictate."
  },
  {
    "clan": "Kurama Clan",
    "title": "Genjutsu Resistance",
    "details": "Beginning at 3rd level, when you are subjected to a saving throw to resist a Genjutsu, add a bonus +1 to your saving throw. This becomes a +2 at 11th level and a +3 at 18th levels."
  },
  {
    "clan": "Kurama Clan",
    "title": "Onijutsu",
    "details": "Beginning at 3rd level you learn how to manipulate your Genjutsu using the Kurama clans secret Kekkei Genkai known as Onijutsu. Born once every 10 generations, the Kurama’s Onijutsu manifests in the form of Onijutsu coils. These coils are proof of the Kurama’s ability to bend fiction into truth. You have a number of coils equal to your level, per long rest. You know three of the following Onijutsu of your choice. You gain another one at 11th and 18th levels. When casting a Genjutsu you may spend 1 coil or 5 Chakra to use the listed Onijutsu. You can use up to two Onijutsu at once with any Genjutsu casting."
  },
  {
    "clan": "Kurama Clan",
    "title": "Careful Onijutsu",
    "details": "When you cast a Genjutsu that forces creatures to make a saving throw, you can protect some of those creatures from the Genjutsu’s effects. Select up to 3 creatures, each creature selected becomes immune to the Genjutsu’s effects for its duration."
  },
  {
    "clan": "Kurama Clan",
    "title": "Punishing Onijutsu",
    "details": "When your target rolls a save against a Genjutsu that you cast, you manifest the illusion into one with more weight by forcing the target to roll an additional d20, using the lowest result of all d20 results."
  },
  {
    "clan": "Kurama Clan",
    "title": "Infectious Onijutsu",
    "details": "When a creature would take damage from a Genjutsu you cast, you can spread the pain. Select one creature you can see within 15 feet of the target, forcing them to make an Intelligence saving throw vs your Genjutsu save DC dealing half of the listed damage on a failed saving throw."
  },
  {
    "clan": "Kurama Clan",
    "title": "Overwhelming Onijutsu",
    "details": "When a creature would critically fail a saving throw for a Genjutsu you cast, you treat the Genjutsu cast as if you had upcasted it by 1 rank. If they would fail by 10 or more you treat the Genjutsu cast as if you had upcasted it by 2 ranks, ignoring rank limitations."
  },
  {
    "clan": "Kurama Clan",
    "title": "Quickened Onijutsu",
    "details": "When you cast a Genjutsu with the casting time of 1 action, you can change the casting time to 1 bonus action for this casting."
  },
  {
    "clan": "Kurama Clan",
    "title": "Subtle Onijutsu",
    "details": "When you cast a Genjutsu you can cast it without handseals or Chakra seal components."
  },
  {
    "clan": "Kurama Clan",
    "title": "Tenacious Onijutsu",
    "details": "When a creature would attempt to dispel or interrupt a genjutsu that you are casting or have casted they reduce their check made to accomplish the task by 1d6."
  },
  {
    "clan": "Kurama Clan",
    "title": "Authoritative Onijutsu",
    "details": "When you would cast a Genjutsu with a sensory keyword that a target would be immune to, you ignore their immunity affecting them anyway."
  },
  {
    "clan": "Kurama Clan",
    "title": "Cursed Onijutsu",
    "details": "When you would cast a Genjutsu that requires a saving throw, you can select a another Genjutsu of D-Rank or lower that you know. If the target of the Genjutsu fails, they suffer the effects of the second genjutsu as if they failed the save even if they critically failed their original save."
  },
  {
    "clan": "Kurama Clan",
    "title": "Cherry Blossom Onijutsu",
    "details": "When a creature would critically fail a Genjutsu you cast, you can choose one ability score between Strength, Dexterity, Intelligence or Wisdom. You reduce the chosen score by 1d4 for either the duration of the jutsu if it is concentration or for 1d4 turns if it is an Instant effect."
  },
  {
    "clan": "Kurama Clan",
    "title": "Elemental Onijutsu",
    "details": "When a creature would take damage from a Genjutsu you cast, you can choose to change the damage type to any one of the following; Earth, Wind, Fire, Cold, Lightning, Acid, Poison or Necrotic."
  },
  {
    "clan": "Kurama Clan",
    "title": "Genjutsu Conversions",
    "details": "Beginning at 7th level, select two Ninjutsu, Taijutsu or Bukijutsu of C-Rank or lower that you qualify for and add them to your known jutsu list. You do not need to meet ability score requirements to learn the chosen jutsu, but you must still meet other keyword requirements such as Nature Release or Medical. These selected Jutsu does not count against your Jutsu known limit and are converted into Genjutsu, losing their Ninjutsu, Taijutsu and Bukijutsu keywords and instead gaining the Genjutsu, Tactile and either Auditory or Visual keywords. You can select an additional Ninjutsu, Taijutsu or Bukijutsu of A-Rank when you would reach 15th level.\n A jutsu that is converted this way retains all effects detailed in its jutsu description except it uses your Genjutsu attack bonus, ability score and save DC for all calculations. You can change which jutsu you convert this way when you complete a Full-Rest."
  },
  {
    "clan": "Kuru Clan",
    "title": "Ability Score Increase (Kuru)",
    "details": "+2 Wis, +1 Con"
  },
  {
    "clan": "Kuru Clan",
    "title": "Speed (Kuru)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Kuru Clan",
    "title": "Skill Proficiencies (Kuru)",
    "details": "Insight, Chakra Control"
  },
  {
    "clan": "Kuru Clan",
    "title": "Tool Proficiencies (Kuru)",
    "details": "You are proficient with Forensic kits\n Kuru Features"
  },
  {
    "clan": "Kuru Clan",
    "title": "Shadow Techniques",
    "details": "The Kuru Clan have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Kuru Clan",
    "title": "Yin Chakra Adept",
    "details": "The Kuru Clan being monks by origin grants them a closer affinity to their Spiritual energy. They have learned through generational training to manipulate the art of Imagination and creation of something from nothing. They are unable to learn the 5 nature affinities as a result of this, instead utilizing their realized Yin chakra in place of any Nature release. Beginning at 1st level, you are unable to learn or cast jutsu with the Earth, Wind, Fire, Water, or Lightning Release Keywords. In exchange your Non-Elemental Ninjutsu, Genjutsu and Taijutsu are all enhanced with your Yin Chakra. Twice per turn per turn, when casting a Ninjutsu or Genjutsu without any Nature release Keyword increase the save DC by 1. Beginning at 11th level, this increases to +2 to Save DC. (If you have a bonus to your Jutsu save DC as a result of a class feature that doesn’t cost an Action or resource of any type, you much choose which bonus to use.)"
  },
  {
    "clan": "Kuru Clan",
    "title": "Kurugan",
    "details": "The Kurugan is known as the Eyes that see through fate. This dojutsu has the ability to peer into the future ever so slightly but only from the user’s point of view. Beginning at 3rd level, you can activate this renowned dojutsu for 10 minutes as a Bonus action.\n Beginning at 7th level, when you activate your Kurugan you can spend an additional 10 chakra as part of the activation. If you do you also activate the Pierce the Veil Kuru Clan jutsu as a part of the same action used to activate the Kurugan.\n For the duration of your Kurugan you gain a +1 bonus to your Wisdom Saving throws. This bonus increases to +2 at 11th level and +3 at 15th level. You lose this bonus when you are Blinded.\n Additionally, when you would make a Charisma based skill check, you gain a bonus equal to half of your Wisdom modifier as you can foresee a creatures’ intentions.\n You can use the following Kuru Clan Features a number of times equal to your proficiency bonus, per long rest.\n+Action: You peer fully into the future calling out the events to your allies just before it happens. You and a number of allies who can hear you gain a +2 bonus to their AC and on the next saving throw they make before the beginning of your next turn. Beginning at 7th level, your allies can use your foresight to aid their offensive attacks gaining a +4 bonus to their first attack roll before the beginning of your next turn.\n+Bonus Action: You peer partially into the future while still maintaining partial awareness on the present. Add your Wisdom modifier to your next attack roll before the end of the current turn.\n+Reaction: You glance into the future to give yourself enough information to make the right move to reduce the chance of suffering a debilitating effect. you gain Advantage vs the first saving throw you make before the beginning of your next turn. Beginning at 7th level, you and all allied creatures within 15 feet of you also gain a +2 bonus to AC, until the beginning of your next turn.. Beginning at 18th level you can foresee the worst future and react to prevent it. The next hostile attack or effect would reduce your hit points to 0 is avoided as you gain immunity to the attack or effect until the end of the current turn."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Ability Score Increase (Namikaze)",
    "details": "+2 Dex, +1 Int"
  },
  {
    "clan": "Namikaze Clan",
    "title": "Speed (Namikaze)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Skill Proficiencies (Namikaze)",
    "details": "Acrobatics, Chakra Control."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Swift Release Affinity",
    "details": "You begin with either Wind or Lightning Release affinity. (Pick one)\n Namikaze Features"
  },
  {
    "clan": "Namikaze Clan",
    "title": "Swift Techniques",
    "details": "The Namikaze Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Supernatural Speed",
    "details": "The Namikaze are known for their incredible reflexes and agility. Starting at 1st level, your speed increases by 5 feet. You gain an additional 5 feet speed increases at 11th and 18th levels.\n Additionally, beginning at 3rd level, due to you to your natural gift for speed, you develop a natural talent for extremely expeditious movement. Represented by Speed die, which are D8’s. You have a number of speed die equal to your proficiency bonus. You can spend up to three of your speed die on the following effects per turn. You regain your speed die on a long rest."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Speed Dodge",
    "details": "You can spend any number of speed die, gaining +2 bonus to AC until the beginning of your next turn, for each die spent."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Speed Amplification",
    "details": "You can spend any number of speed die, gaining movement speed equal to 5 x the result of the roll until the beginning of your next turn."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Quickened Assault",
    "details": "When you take the attack action to make a weapon attack, you may spend speed die. You make one additional weapon attack for each speed dice spent. You deal damage with these weapon attack equal 1d8, and do not add your ability modifier."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Blink of an Eye",
    "details": "When you would move, you instead choose a location you can see within your movement speed range. Spend one Speed Die, you teleport to the desired location. If you were to make a melee weapon attack against a creature within 5 feet of you, you roll 1d8, adding the result to your attack roll."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Swift Focus",
    "details": "While you are gaining the benefits of a Namikaze clan Hijutsu or Jutsu with the Wind or Lightning Release keywords that requires concentration, by spending 1 Speed die, you may reduce the Chakra cost to maintain the jutsu by the result of your roll, once per turn."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Like the Wind",
    "details": "When you would deal Wind damage to a creature as a result of casting a Jutsu with the Lightning or Wind Release Keywords, you may spend a speed die, increasing the damage dealt by the result, and as a part of the same action used to cast the jutsu, you teleport behind the target and gaining a bonus to your next attack roll against the same target equal to the result of your roll."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Flash of Defense",
    "details": "When you would take damage from a creature as a result of an attack that targeted you, or saving throw you were forced to make, you may spend any number of Speed die, reducing the damage dealt by the result."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Swift Release",
    "details": "The Namikaze clan has a unique talent for manifesting Swift Release due to their close affinity to both Wind and Lightning Release. Beginning at 7th level you gain the second Nature release you didn’t select from Swift Release Affinity clan trait. When casting a jutsu with either Lightning or Wind Release keywords, you can change the damage type to Wind. Also, at 7th level, twice per turn, when you would deal Wind damage, you add your proficiency bonus to the damage roll."
  },
  {
    "clan": "Namikaze Clan",
    "title": "Evasive Nature",
    "details": "Namikaze clan members speed and agility allows them to better protect themselves from harm. Beginning at 1st level if you are wearing Light or Medium Armor, you gain a +1 bonus to your Dexterity saving throws. This increases to +2 at 11th level. Additionally, while you are concentrating on a Namikaze Clan Hijutsu, a creatures first attack against you per turn, is made at disadvantage.\n Beginning at 15th level, when you would be forced to make a Dexterity saving throw to take half damage, you can choose to succeed instead, taking no damage or any adverse effects. You can only use this effect of Evasive Nature twice per long rest."
  },
  {
    "clan": "Nara Clan",
    "title": "Ability Score Increase (Nara)",
    "details": "+2 Int, +1 Cha"
  },
  {
    "clan": "Nara Clan",
    "title": "Speed (Nara)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Nara Clan",
    "title": "Skill Proficiencies (Nara)",
    "details": "Investigation, Insight"
  },
  {
    "clan": "Nara Clan",
    "title": "Preplanned Jutsu",
    "details": "You know 1 additional Nara Clan D-Rank Jutsu. This does not count against your total jutsu known.\n Nara Features"
  },
  {
    "clan": "Nara Clan",
    "title": "Shadow Possession Techniques",
    "details": "The Nara have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Nara Clan",
    "title": "Coordinate",
    "details": "Beginning at 1st level, when you would roll initiative, you can spend your Reaction coordinating your allies. When you do, all allies gain the Coordinated condition until initiative ends. This special condition, is treated as a Mental condition. There are two different variants of Coordinated, one being reserved for Combat called Combat Coordination, the other for Social encounters called Diplomatic Coordination. Regardless, once you use this feature twice, you cannot do so again until you complete a Long rest. This increases to three times at 11th level and four times at 18th level."
  },
  {
    "clan": "Nara Clan",
    "title": "Master Tactician",
    "details": "Descendants of the Nara Clan are unusually tactical. They are able to offer guidance both inside and outside of battle using their amazing wit and cleverness. Beginning, at 3rd level, you can provide a Tactical Die (D4), to any ally that fails an attack roll, saving throw or skill/ability check, that you can see within 60 feet of you, as a reaction. When you do, they roll the die and add the result to their failed attack, save or skill/ability check. You can use this clan feature a number of times equal to your proficiency bonus per long rest. At 11th Level, the die becomes a d6 and at 18th level a d8."
  },
  {
    "clan": "Nara Clan",
    "title": "Genius Potential",
    "details": "Nara are people of mental flexibility and potential, able to pick up on things faster than others. At 7th level When you would make a Dexterity, Wisdom, or Charisma saving throw to resist a hostile creatures feature, trait or jutsu, you may add your Intelligence Modifier to the result. You may use this feature a twice per long rest. You gain an additional use of this feature at 15th level."
  },
  {
    "clan": "Nara Clan",
    "title": "Masterwork Skill",
    "details": "Nara Are known for their adept ability at completing complex mental tasks. At 7th Level You may select two skills, you gain proficiency in these skills. You select two more skills at level 18th level."
  },
  {
    "clan": "Nara Clan",
    "title": "Masters of The Shadows",
    "details": "Nara’s Hijutsu are known for being able to bend shadows to their will. Beginning at 7th level, when you would restrain a creature using a Nara clan Hijutsu, if that creature is in bright light, increase the Save DC of that Hijutsu by +1. Beginning at 15th level, you gain this bonus even if you are in Dim Light."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Ability Score Increase (Non-Clan)",
    "details": "+2 to any Ability Score, +1 to any other Ability Score not selected previously (or +1 to any 3 Ability Scores.)."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Speed (Non-Clan)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Skill Proficiencies (Non-Clan)",
    "details": "Pick any 2 Skills to gain proficiency in."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "General Literacy",
    "details": "You reduce the ability score requirement to learn and cast all jutsu by 2. For Ability score requirements, check the SHB, pg.121).\n Non-Clan Features"
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Self-Taught Skills",
    "details": "You are one of pure hard work with no family ties that grant you any natural advantages or benefits. At 1st level select any 1 skill. You gain proficiency in the chosen skill. If you are already proficient in the chosen skill, you instead gain expertise in it. You may select another skill at 7th and 15th level gaining proficiency, or expertise if already proficient."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Unrelenting Focus",
    "details": "In your quest for greatness, you have achieved what your allies have not, additional talents that potentially takes years of extra training that those who are born in a clan do not have the time to commit to. Starting at 1st level you gain a Feat of your choice. You may gain additional feats at 3rd, 11th, and 18th levels."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Nindo",
    "details": "You are not someone who gives in easily. You have created a short saying to yourself, something you repeat to yourself when you are in a tight spot and when your backs against the wall. At 3rd Level Select any of the following “Nindo” and reflavor the wording to whatever suits your shinobi. You gain the effects of the Nindo you select. Beginning at 11thh level, you may select a second Nindo and at 18th level you may select a third Nindo."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never back down",
    "details": "This Nindo is one of tenacity. When an ally has fallen unconscious after falling to 0 Hit points and you are outnumbered. You gain advantage to attack rolls and Dexterity Saves for the next minute. If you pass the Dexterity save while this Nindo is active, you ignore the effects entirely. You can gain the benefit of this effect, once per long rest."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never Give up",
    "details": "This Nindo is one of perseverance. The first time you are reduced to 0 Hit points by a hostile creature, you are instead reduced to 1 Hit point. You cannot go below this 1 hit point until the end of your next turn. When you fall unconscious or enter the dying condition, you roll your Death saving throws at advantage. You cannot gain the benefits of this feature more than once per rest."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never Abandon a Friend",
    "details": "This Nindo is one of compassion. The first time an ally is reduced to 0 or less Hit points and you can see them, double your movement speed and gain advantage on Wisdom (Medicine) checks to stabilize or heal them. If a Jutsu is used on the unconscious ally while this effect is active that restores Hit Points, Target ally is stabilized, gains double the appropriate Hit Points, and gains additional Temporary Hit points equal to your Proficiency Bonus. This lasts for 1 minute or until they are stabilized or dead. You can gain the benefit of this effect, once per long rest."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never Lose",
    "details": "This Nindo is one of power. When you would lose a clash with a hostile creature, you can choose to reroll your check at advantage. If you win using this reroll, you jutsu adds your proficiency bonus to its damage, if it deals damage, or increase its save DC by 1d4, if it requires a saving throw. If you still fail, you do not suffer from the effects of losing a clash check, but you cannot gain the benefit of this feature until you complete a rest."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never Fail",
    "details": "This Nindo is one of resilience. When you would fail a saving throw that would reduce you to an amount equal to or less than half your maximum hit points, you can choose to automatically succeed instead. If you do, you instead suffer no damage or effects that would normally be inflicted on a success. Once used, you cannot gain the benefits of this feature until at least 10 minutes has passed."
  },
  {
    "clan": "Non-Clan Clan",
    "title": "Never Give In",
    "details": "This Nindo is one of resolve. When an allied creature is killed, and you can see them, you can spend your reaction to yell a statement of resolve, empowering them. An allied creature who was killed, is instead stabilized. You cannot use this feature again until at least 1 hour has passed."
  },
  {
    "clan": "Ranton Clan",
    "title": "Ability Score Increase (Ranton)",
    "details": "+2 Dex, +1 int"
  },
  {
    "clan": "Ranton Clan",
    "title": "Speed (Ranton)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Ranton Clan",
    "title": "Skill Proficiencies (Ranton)",
    "details": "Ninshou, Nature."
  },
  {
    "clan": "Ranton Clan",
    "title": "Storm Release Affinity",
    "details": "You begin with either Water or Lightning Release affinity. (Pick one)\n Ranton Features"
  },
  {
    "clan": "Ranton Clan",
    "title": "Storm Techniques",
    "details": "The Ranton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Ranton Clan",
    "title": "Twin Style",
    "details": "Beginning at 1st level, you hail from one of two different styles of Storm Release. Either Storm Style, or Laser Style. Storm style utilizes Lightning Charged Water to create powerful shocking tides, while laser style prioritizes the fluid properties of Water to create beams of Lightning. Select between either Storm Style or Laser Style. Once chosen, this cannot be changed later. Your chosen style grants you access to different Ranton Clan Hijutsu and some unique Ranton Clan features with the corresponding style keyword as follows;"
  },
  {
    "clan": "Ranton Clan",
    "title": "Shocking Wave",
    "details": "Beginning at 1st level, Ranton Hijutsu you cast has its area of effect increased by +5 feet. This increases to +10 feet at 11th and +15 feet at 18th level."
  },
  {
    "clan": "Ranton Clan",
    "title": "Pervasive Lightning",
    "details": "Beginning at 1st level, Ranton Hijutsu you cast that requires you to make an attack, gains a +1 bonus to hit against a creature with ranks of shocked, twice per casting. This bonus increases to +2 at 11th level and +3 at 18th level."
  },
  {
    "clan": "Ranton Clan",
    "title": "Storm Release",
    "details": "The Ranton clan has a unique talent for manifesting Storm Release due to their close affinity to both Water and Lightning Release. Beginning at 7th level you gain the second Nature release you didn’t select from Storm Release Affinity clan trait. Also, at 7th level, once per turn, when casting a jutsu with either Water or Lightning Release keyword, you can change the damage type to Lightning and increase the damage by +2 damage dice. This increases to +3 dice at 18th level."
  },
  {
    "clan": "Ranton Clan",
    "title": "Galvanation",
    "details": "At 11th level, you can evolve a creatures shocked condition to a new level, called Galvanized. When a creature with 5 ranks of the shocked condition would gain another rank of the shocked condition, they instead become Galvanized. A Galvanized creature suffers the following effects.\n A Galvanized creature loses all ranks of the shocked condition, is counted as Shocked 5 for the purposes of interacting with features, traits and jutsu and cannot gain ranks of shocked condition while they are Galvanized.\n A Galvanized creature takes 5d6 Lightning when they would take a Reaction.\n A Galvanized creature cannot cast jutsu with the Mobility (M) component.\n The Galvanized condition lasts for 1 minute."
  },
  {
    "clan": "Ryu Clan",
    "title": "Ability Score Increase (Ryu)",
    "details": "+2 Int, +1 Con"
  },
  {
    "clan": "Ryu Clan",
    "title": "Speed (Ryu)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Ryu Clan",
    "title": "Skill Proficiencies (Ryu)",
    "details": "Ninshou, Chakra Control"
  },
  {
    "clan": "Ryu Clan",
    "title": "Weapon Proficiencies (Ryu)",
    "details": "You are proficient with Katana’s.\n Ryu Features"
  },
  {
    "clan": "Ryu Clan",
    "title": "Dragon Clan Jutsu",
    "details": "The Ryu Clan have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Ryu Clan",
    "title": "Blood of the Dragon",
    "details": "Born with the blood of dragons running through your veins you have the natural affinity with one of the 5 Dragons your clan worships. Beginning at 1st level, Choose between Earth, Wind, Fire, Water and Lightning Release. You gain the ability to learn and cast jutsu with the chosen nature release and all of your Ryu Clan jutsu gains your chosen keyword. You cannot go back and change this element later."
  },
  {
    "clan": "Ryu Clan",
    "title": "Dragon’s Claws",
    "details": "Beginning at 3rd level, you learn to form your Chakra into claws on both your hands and feet of your description. This makes your unarmed attacks Chakra enhanced and far more powerful than normal. Your unarmed damage die becomes a d6 and deals the same damage type as the nature release chosen with your Blood of the Dragon class feature (Water = cold). Your unarmed damage die becomes a d8 at 11th level and a d10 a 18th level."
  },
  {
    "clan": "Ryu Clan",
    "title": "Dragon’s Rage",
    "details": "Beginning at 3rd level, you learn how to call upon the boiling rage that’s innate to your bloodline. As an action, you unleash your elemental dragons’ wrathful energy, causing scales made of Chakra to form. Your eyes also begin to glimmer. Your scales and eyes are all a color that matches your chosen nature release from your Blood of the Dragon clan feature. (Brown = Earth, Emerald = Wind, Red = Fire, Blue = Water, Gold = Lightning). Your transformation lasts for 1 minute or until you end it as a bonus action. For the duration you gain a +1 to your AC, you can cast all Ryu clan Hijutsu using Constitution as your Ninjutsu ability modifier, and your unarmed attacks made using your Dragon Claws can use Constitution for attack and damage rolls. You can activate your Dragon’s Rage once per rest. If you would activate it any time after the first, prior to completing a rest, you can spend 1 Chakra die to activate it.\n At 7th level your rage reaches new heights. You can activate your Dragon Rage feature as a bonus action. While benefiting from your Dragon’s Rage, your claw attacks damage die increases by +1 twice per turn, you gain resistance to your chosen nature releases damage type, your speed increases by +10 and once per turn, you can deal extra damage of your chosen nature releases damage type to one target, equal to your character level when you deal damage to it with an attack or jutsu.\n Starting at 11th level you begin to exhibit more draconic features. Your bonus to AC becomes a +2, your Dragon Claws damage die increases by +2 twice per turn, Ninjutsu you cast of your chosen nature release has their cost reduced by 2 (Min 1.), You can activate Dragon’s Rage twice per rest without spending a Chakra die.\n Starting at 15th level your Dragon Claws damage die increases by +3 twice per turn, Ryu Clan Jutsu you cast while benefiting from Dragon’s Rage ignores resistance and their concentration cost is reduced by half.\n At 18th level you have fully bonded to the nature affinity your Dragon represents. Ryu Clan Jutsu you cast can no longer be ended as a result of damage or failing a concentration check."
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Ability Score Increase (Sarutobi)",
    "details": "+2 Str or Int, +1 Con"
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Speed (Sarutobi)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Skill Proficiencies (Sarutobi)",
    "details": "Pick any two skills between: Ninshou, Martial Arts, Illusions"
  },
  {
    "clan": "Sarutobi Clan",
    "title": "General Literacy (Sarutobi)",
    "details": "All ability scores are counted as being +1 higher, for the purpose of casting Higher Ranked jutsu through any Ability Score Requirements (SHB, pg. 108)\n Sarutobi Features"
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Advanced Nature Transformation",
    "details": "Sarutobi are known for their advanced innate knowledge in Chakra molding and nature release. Starting at 1st Level, select one of the following special keywords Earth Release, Wind Release, Fire Release, Water Release, Lightning Release or Medical. You gain the ability to cast jutsu with the corresponding keyword. At 7th Level, you select a second keyword from the previous list."
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Advanced Chakra Control",
    "details": "Additionally, at 1st level, Sarutobi are known for their ability to squeeze every ounce of efficiency out of every jutsu they have in their repertoire. Select between Ninjutsu, Genjutsu, Taijutsu or Bukijutsu, you can use Jutsu with the select Keyword with a level of efficiency others wish they had.\n If Ninjutsu, select between the following keywords; (Earth, Wind, Fire, Water, Lightning) Release or Medical.\n If Taijutsu or Bukijutsu, select between the following keywords; Combo or Finisher.\n If Genjutsu, select between the following Keywords; Auditory, Inhaled, Tactile, and Visual\n You may reduce the Chakra cost of jutsu with the select keyword by 1 (min 1). You may reduce Jutsu with this Keywords Chakra cost by an additional 1 Chakra at 7th and 15th levels.\n At 11th level, you may select 1 additional Keyword from the aforementioned Ninjutsu, Taijutsu or Genjutsu to reduce the cost of by the same amount. You cannot select the same keyword multiple times. If a Jutsu has multiple selected Keywords the Cost reduction is only applied once."
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Inheritors of the Will of Fire",
    "details": "As a Sarutobi, you have inherited the Will of Fire from your forefathers. Beginning at 3rd level, you have found that Focus and Determination is what makes a shinobi strong. You gain a number of Focus points equal to your proficiency bonus per long rest. These Focus Points can be spent to do the following;\n Spend 1 Focus to gain a +2 Bonus on an Attack Roll\n Spend 1 Focus to gain a +2 Bonus on a Saving Throw\n Spend 1 Focus to gain a +2 Bonus on a skill Check\n Spend 3 Focus to gain an Immediate reaction, even with an ability or Jutsu that is an action.\n Spend 3 Focus to automatically Succeed a Death Saving throw."
  },
  {
    "clan": "Sarutobi Clan",
    "title": "Advanced Nature Proficiency",
    "details": "As a Sarutobi, you have advanced learning potential in your natural elemental affinity. At 1st level, you may select 1 D-Rank Ninjutsu that has a Nature Release selected as a part of your Advanced Nature Transformation clan feature, add that jutsu to your known jutsu list. You learn 1 additional C-Rank Jutsu at 3rd Level, you learn 1 additional B-Rank Jutsu at 7th Level, you learn 1 additional A-Rank Jutsu at 15th Level."
  },
  {
    "clan": "Senju Clan",
    "title": "Ability Score Increase (Senju)",
    "details": "+2 Con, +1 Str"
  },
  {
    "clan": "Senju Clan",
    "title": "Speed (Senju)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Senju Clan",
    "title": "Skill Proficiencies (Senju)",
    "details": "Chakra Control, Ninshou."
  },
  {
    "clan": "Senju Clan",
    "title": "Wood Release Affinity",
    "details": "You begin with either Earth or Water Release Affinity. (Pick one)\n Senju Features"
  },
  {
    "clan": "Senju Clan",
    "title": "Wood Techniques",
    "details": "The Senju Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Senju Clan",
    "title": "Built Different",
    "details": "Beginning at 1st level, the Senju are known for their downright gargantuan stamina. Increase your Hit Point total by 2. Every level thereafter each time you gain a level, increase your hit point total by 2."
  },
  {
    "clan": "Senju Clan",
    "title": "Mitotic Regeneration",
    "details": "Beginning at 1st level, you learn to create a reservoir of Chakra in form of Senju Cells. These cells are a byproduct of your exceptional bloodline which allows you to remain healthy and ready for battle. You have a number of Senju Cells equal to your level per long rest. You can spend these cells to accomplish any of the following;\n As a bonus action, you can spend any number of cells, regaining 1d6 + Constitution modifier hit points, per cell spent. This increases to a d8 at 11th level.\n As a bonus action, you can spend any number of cells to remove 1 rank of any Physical or Elemental condition you are under the effects of, per cell spent.\n Beginning at 7th level, As a reaction to your hit points falling to 0 or lower, you can spend 5 cells to instead fall to 1 hit point."
  },
  {
    "clan": "Senju Clan",
    "title": "Sacred Body",
    "details": "Beginning at 3rd level, you learn to leverage your stamina to manage your Senju Hijutsu. You may use Constitution as your Ninjutsu ability modifier of Senju Hijutsu that you cast."
  },
  {
    "clan": "Senju Clan",
    "title": "Wood Release",
    "details": "The Senju has a unique talent for Manifesting Wood Release, due to their close affinity to both Earth and Water Release. Beginning at 7th level, you gain the second Nature release you didn’t select from Wood Release Affinity and when you would cast a jutsu with either Water or Earth Release keywords that would deal damage, you can change the damage type to Earth. Additionally, a creature Restrained or Grappled as a result of a Senju Hijutsu that you cast, has their chakra network impeded, which increases the cost of the next jutsu they cast by an amount equal to the rank of the jutsu restraining or grappling them. (D-Rank  +8, C-Rank: +12, B-Rank: +16, A-Rank: +20, S-Rank: +24.);"
  },
  {
    "clan": "Senju Clan",
    "title": "Blood of the Leaf",
    "details": "Beginning at 11th level, you have mastered the art of communication and negotiating hostile terms. When you would make a Charisma check in an attempt to persuade or intimidate a hostile or unfriendly creature, you can instead use your Strength or Constitution in place of Charisma as you exude the full force of your physical presence in an attempt to make them understand the situation they are in."
  },
  {
    "clan": "Senju Clan",
    "title": "Mokuton’s Suppression",
    "details": "Beginning at 18th level, at the beginning of a creatures turn who is Restrained, Grappled, or within an area of difficult terrain created by a Senju Hijutsu that you cast, they must make a Constitution saving throw vs your Ninjutsu Save DC. On a failure for the duration of their condition, they are unable to Mold Chakra."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Ability Score Increase (Shakuton)",
    "details": "+2 Int, +1 Wis"
  },
  {
    "clan": "Shakuton Clan",
    "title": "Speed (Shakuton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Skill Proficiencies (Shakuton)",
    "details": "Survival, Ninshou."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Scorch Release Affinity",
    "details": "You begin with either Wind or Fire Release Affinity. (Pick one)\n Shakuton Features"
  },
  {
    "clan": "Shakuton Clan",
    "title": "Scorch Techniques",
    "details": "The Shakuton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release’s to use their Clan jutsu."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Even Hotter",
    "details": "Beginning, at 1st level, jutsu you cast that deals Fire damage to a creature currently under the effects of the burned condition takes 2d4 bonus Fire damage, up to twice each turn. Beginning at 11th level, this bonus damage increases to 4d4. Beginning at 18th level, this bonus damage increases to 6d4."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Scorching Heat",
    "details": "Beginning at 3rd level, your super-heated Chakra has granted you the ability to super heat other jutsu with it. You gain a number of Scorch die, which are D4’s, equal to your proficiency bonus. When you would deal Fire damage, you may spend a number of Scorch die, which when rolled is either; Added to the total Fire damage dealt, ignoring resistances, or if a creature would make a saving throw of any type to resist an effect or condition imposed by a jutsu with the Fire or Wind Release Keyword, they reduce their saving throw by half of the result of your Scorch die (Min 1). You regain spent scorch die when you would take a rest of any type."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Scorching Aura",
    "details": "Starting at 3rd level, when you would deal Fire damage to structures or constructs made of organic material (wood, grass, flesh etc.) they make their saving throw at disadvantage.\n Beginning at 11th level, you have learned to leverage your Superheated Chakra to benefit your allies as well. When an allied creature within 30 feet of you would cast a jutsu, you may spend a scorch die, giving their jutsu the Fire Release keyword for this casting. A creature who’s jutsu you have augmented in this way, gains the benefit of your Scorching Heat clan feature as if they had it, spending your scorch die, when they would spend any.\n Beginning at 15th level, when you would spend at least two scorch die on a jutsu, either yours or an allies, you increase the damage die of the jutsu cast by 1 step (D4>D6>D8>D10>D12)\n Beginning at 18th level, when you would use this feature on an allied creature, the next ninjutsu they cast that would deal damage or force a creature to make a saving throw, its damage is increased by 1 step and it also forces an affected creature to make a Constitution saving throw, being burned on a failed save."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Scorch Release",
    "details": "The Shakuton has a unique talent for manifesting Scorch release, due to their close affinity to both Wind and Fire Release. Beginning at 7th level, you gain the second Nature release you didn’t select from Scorch Release Affinity.\n Also, at 7th level, when you would cast a jutsu with either Wind or Fire Release keywords that would deal damage, you can change the damage type to Fire. Also, a creature who has gained ranks of the burned condition from a jutsu that you cast, must make a Constitution saving throw, gaining 1 rank of weakened for the duration of the burned condition."
  },
  {
    "clan": "Shakuton Clan",
    "title": "Immolation",
    "details": "Beginning at 11th level, you can evolve a creatures burned condition to a new level, called Immolated. When a creature with 5 ranks of the burned condition would gain another rank of the burned condition, they instead become Immolated, losing all ranks of burned as it is replaced with 1 rank of Immolated. An Immolated creature suffers the following effects.\n An Immolated creature is counted as Burned for the purposes of interacting with features, traits and jutsu and cannot gain ranks of burned condition while they are Immolated.\n An Immolated creature takes 5d10 Fire damage at the beginning of each of their turns.\n An immolated creature automatically fails concentration checks.\n Creatures that are immune to Fire damage is immune to this condition.\n A Creature can spend an Action to make a DC 20 Dexterity (Survival) Check to put out the flames. On a successful check, the condition ends or submerging themselves fully into a body of Water."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Ability Score Increase (Shikigami)",
    "details": "+2 Int, +1 Dex"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Speed (Shikigami)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Skill Proficiencies (Shikigami)",
    "details": "Sleight of Hand, Performance"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Tool Proficiencies (Shikigami)",
    "details": "Weaponsmiths Kit, Demolitions Kit\n Shikigami Features"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Shikigami Techniques",
    "details": "The Shikigami Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Papercraft",
    "details": "The Shikigami Clan learns to craft with paper from a young age. Beginning at 1st level, when you would gain the benefits of a short or long rest, you can craft up to two of the following with no additional resources required. Additionally, you reduce the ryo cost and downtime cost to craft the following Items during downtime by half. This does not stack with other features that reduce downtime cost to craft the following items.\n Breaching Tag\n Paper Bomb\n Explosive Tag Ball\n Flash Tag\n Poison Gas Tag\n Ninja tools crafted this way do not have any bulk, and last for 24 hours before becoming inert. Beginning at 11th level when you would use this feature to craft a ninja tool, you instead can craft four. Beginning at 18th level this increases to six.\n Additionally, if you have a Demolitions Kit, you can spend 10 minutes and 1 use of it to create one of the listed items at the Greater Quality. When you would gain the benefit of this feature over the course of a short rest, you can spend 2 uses of your Demolitions Kit to create two additional items. When you would gain the benefit of a long rest, you can spend 3 uses of your Demolitions Kit to create five additional items. When you would gain the benefit of Downtime to create the listed Items, you create twice the amount you would normally make."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Paper Expert",
    "details": "You learn to draw out the power of paper-based ninja tools. Beginning at 3rd level, when you would use a Breaching Tag, Paper Bomb, Explosive Tag Ball, Flash Tag or Poison Gas Tag, the DC of these Tags are modified and are now equal to your Ninjutsu Save DC, if your Ninjutsu save DC would be higher than the listed Ninja tools Save DC.\n Beginning at 7th level, when you would use a Breaching Tag, Paper Bomb, Explosive Tag Ball, Flash Tag or Poison Gas Tag you can enhance them by infusing your chakra into them. When you do you spend 5 chakra for each bonus gained;"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Bonus Damage",
    "details": "If the enhanced item deals damage, increase the damage dealt by 2 damage die of each damage type for each application of this bonus. If this bonus is used with a Flash Tag, you also deal 4d6 Lightning damage on a failed save or half as much on a failed save. If used with a Poison Gas tag, you also deal 4d6 poison damage on a failed save or half as much on a failed save."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Bonus DC",
    "details": "Increase the Items save DC by +2."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Bonus Radius",
    "details": "Increase the affected range or radius by 10 feet for each application of this bonus."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Paper Reservoir",
    "details": "At 7th level, you may reduce the chakra cost of Jutsu with the Chakra Seal Component (CS) by 1. This reduction increases to 2 at 11th level and 3 at 15th level (Min 1.)"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Divine Shikigami",
    "details": "Beginning at 11th level, you may expend paper-based ninja tools (Breaching Tag, Paper Bomb, Explosive Tag Ball, Flash Tag or Poison Gas Tag) to enhance the power of your Hijutsu. When you would cast a Shikigami Clan Hijutsu, you may spend one of the aforementioned ninja tools, incorporating them into your jutsu. Your Jutsu is enhanced using the following effects, based on the following Ninja tools used. Some Enhanced effects will require a saving throw of an affected creature, the Save DC is always your Ninjutsu save DC;"
  },
  {
    "clan": "Shikigami Clan",
    "title": "Breaching Tag",
    "details": "Your jutsu explodes on contact, dealing focused, localized damage. Your Jutsu’s Damage type becomes Fire, deals an additional 2 damage die of damage, and deals double damage to structures and constructs."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Paper Bomb or Explosive Tag Ball",
    "details": "Your jutsu ignites with reckless abandon creating an enhanced mobile bomb. Regardless of a hit or miss, you may trigger your jutsu to explode. All creatures within 25 feet of the original target creature must succeed a Dexterity saving throw, taking 4d6 fire damage or half as much on a successful. If used with a Jutsu that affects an area, you instead increase the Jutsu's range by 10 feet and all creatures who fail the jutsu’s saving throw take an additional 4d6 fire damage or half as much on a successful one."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Flash Tag",
    "details": "Your jutsu erupts into a violent flash of blinding white light. Regardless of a hit or miss, you may trigger your jutsu to explode into this blinding light. All creatures within 25 feet of the original target creature must succeed a Wisdom saving throw, being blinded for 1 minute on a failed save. If used with a Jutsu that affects an area, you instead increases the range of the jutsu by 10 feet and all creatures within the target area who fail the Jutsu’s saving throw also become blinded for 1 minute on a failed save. A blinded creature makes Wisdom Saving throw vs the Jutsu’s Save DC at the end of each of their turns to end the blinded condition."
  },
  {
    "clan": "Shikigami Clan",
    "title": "Poison Gas Tag",
    "details": "Your Jutsu exudes a noxious purple gas. Regardless of a hit or miss, you may trigger your jutsu to expel this poisonous gas. All creatures within 25 feet of the original target creature must succeed a Constitution saving throw, being Poisoned for 1 minute on a failed save. If used with a Jutsu that affects an area, this feature instead increases the range of the jutsu by 10 feet and all creatures who fail the jutsu’s saving throw are Poisoned on a failed save."
  },
  {
    "clan": "Shoton Clan",
    "title": "Ability Score Increase (Shoton)",
    "details": "+2 Con, +1 Cha"
  },
  {
    "clan": "Shoton Clan",
    "title": "Speed (Shoton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Shoton Clan",
    "title": "Skill Proficiencies (Shoton)",
    "details": "Nature, Survival"
  },
  {
    "clan": "Shoton Clan",
    "title": "Crystal Release Affinity",
    "details": "You begin with Earth Release Affinity\n Shoton Features"
  },
  {
    "clan": "Shoton Clan",
    "title": "Crystal Release",
    "details": "The Shoton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Shoton Clan",
    "title": "One with Earth",
    "details": "Shoton’s are known for being rash, headstrong and stubborn. These personality traits tend to bleed into their affinity for earth Release Jutsu. Beginning at first level, you may use Charisma as your Ninjutsu ability modifier when casting Ninjutsu with the Earth Release Keyword."
  },
  {
    "clan": "Shoton Clan",
    "title": "Crystalline Stone",
    "details": "Beginning at 1st level, your crystalline techniques allow you to reinforce any earth based jutsu that produces Earthen Constructs. Earthen Constructs you summon as a result of Ninjutsu with the Earth release keyword gains 3 DR (damage reduction) vs all sources except for Lightning & psychic damage. This increases to 6 DR at 11th level."
  },
  {
    "clan": "Shoton Clan",
    "title": "Rock Hard Stability",
    "details": "Starting at 3rd level, when you are under the effects of a Ninjutsu with the Earth Release Keyword, you gain a +1 Bonus to your Constitution Saving throws. This bonus increased to a +2 at 11th level and a +3 at 18th level."
  },
  {
    "clan": "Shoton Clan",
    "title": "Crystalized Focus",
    "details": "Starting at 7th level, you have learned how to reinforce the molecular structure of Stone, Crystal and other earth-based materials. This reinforcement is represented as a pool of d10’s called Crystallization Die. You begin with 4 of these Crystallization die. You gain more as you increase in level, gaining 2 more when you reach 15th level. You regain all expended uses of this die when you complete a short or long rest. You can spend Crystallization Die by using the following criteria;\n [New] When a Ninjutsu you cast has the Earth Release keyword, you gain a +2 bonus to your AC, until the beginning of your next turn.\n When a Ninjutsu you cast with the Earth Release keyword deals earth damage you can, you can spend any number of Crystallization Die adding the result to the damage, once per casting.\n When a Ninjutsu you cast with the Earth Release keyword would create an Earthen Construct, you can spend any number of Crystallization Die adding the result to the constructs total hit points. You can do this once per casting.\n When a Ninjutsu you cast, with the Earth Release keyword would intercept damage for you either reducing it or taking damage and reducing its own hit points, you may spend 1 Crystallization die, increasing its Damage Reduction by half the result. You can do this twice per turn."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Ability Score Increase (Tsuchigumo)",
    "details": "+2 Dex, +1 Wis"
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Speed (Tsuchigumo)",
    "details": "Your base walking speed is 35 feet."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Skill Proficiencies (Tsuchigumo)",
    "details": "Acrobatics, Perception"
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Weapon Proficiencies (Tsuchigumo)",
    "details": "You are proficient with Shortbow’s and Longbows.\n Tsuchigumo Features"
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Spider Techniques",
    "details": "The Tsuchigumo Clan have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Third Eye",
    "details": "The Tsuchigumo are widely known as “Arachnoids” or “Spider people” from their closeness to such insects. But what most don’t know about is the third eye that reveal themselves on your forehead as you grow older. Beginning at 1st level, your third eye has reached maturity, and it opens at your command. Once per rest, as a Bonus action, you open your third eye, increasing your perceptive abilities by a wide margin for the next 10 minutes. For the duration, you gain the following;\n Expertise in checks made with the Search skill action.\n Beginning at 3rd level, you gain a special action which can only be taken using your Third eye known as the Spider Search action.\n Spider Search. As an Action, you can make a Wisdom (Perception) check vs the Passive Deception of one creature you can see within 120 feet of you. On a success you become aware of the targets highest attack bonus (Weapon, Ninjutsu, Genjutsu, Taijutsu). If you fail this check, you cannot use this action against the same creature until you complete a rest of any type.\n Beginning at 11th level you increase both range increments of Short and Long bows by +30 feet. This increases to +60 feet at 18th level."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Web Weapons",
    "details": "Also at 1st level, as a bonus action you can generate enough webbing to create Web weapons. All Web Weapons have the Light, Multiattack and Lethal 1 weapon properties. When you make a Web Weapon, you create any simple melee weapon or any simple or martial ranged weapon with the Ammunition property, that does not have the Heavy weapon property. Weapons with the Ammunition property that you creature do not need to roll ammunition die as you create new ammunition from your webs with each attack."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Web Traps",
    "details": "Beginning at 3rd level you can produce spider webs by infusing your spit or sweat with chakra. You can use this web to create a variety of traps. When you do, you can create the following traps without the assistance of a kit and reducing their time to build down to 1 minute; Alarming, Deadfall, Restraining and Weapon Traps. When building the listed traps using your webs, you gain a +1d4 bonus to the check made to build them. This increases to +2d4 at 11th and +3d4 at 18th levels."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Exoskeleton",
    "details": "Beginning at 3rd level, as a reaction to taking damage, you can conjure a thick coat of golden armor which can take brutal impacts absorbing some damage for you. When you do, you gain 6 DR (damage reduction) vs all sources and immunity to chakra damage or chakra cost penalties until the beginning of your next turn. This increases to 10 at 11th and 14 at 18th levels."
  },
  {
    "clan": "Tsuchigumo Clan",
    "title": "Tsuchigumo Senses",
    "details": "Beginning at 7th level, you find it impossible to be caught off guard. Creatures cannot gain advantage on attack rolls against you as a result of being hidden or unseen. Additionally, you cannot be surprised in combat allowing you to act normally during a Surprise round. Starting at 15th level you add your Wisdom Modifier to initiative rolls."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Ability Score Increase (Uchiha)",
    "details": "+2 Dex or Int, +1 Int or Wis (You cannot choose Int for both ASI’s)"
  },
  {
    "clan": "Uchiha Clan",
    "title": "Speed (Uchiha)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Skill Proficiencies (Uchiha)",
    "details": "Insight, Pick one between: Ninshou, Martial Arts, Illusions"
  },
  {
    "clan": "Uchiha Clan",
    "title": "Passive Affinity (Uchiha)",
    "details": "You have Fire Release affinity\n Uchiha Features"
  },
  {
    "clan": "Uchiha Clan",
    "title": "Uchiha Techniques",
    "details": "The Uchiha have access to a separate list of Jutsu unique to their clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Advanced Adaptation",
    "details": "Uchiha are known for their extreme adaptation on the battlefield. Able to see, comprehend, understand and react all in a hair’s breadth with or without a Sharingan. At 1st level you gain one of the following adaptations. You can select another of these adaptations beginning at 7th, 15th and 18th level."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Agile Stance",
    "details": "If you have the Uchiha Awaiting Stance Clan Jutsu on your known Jutsu list, when a creature’s attack would miss you, you are able to, as a reaction, use the jutsu’s effects as if they missed you while you had it casted at D-Rank, at no Chakra cost. Beginning at 9th level, you treat this casting a C-Rank, and B-Rank at 13th level. You may use this stance a number of times equal to your Taijutsu Ability Modifier per short rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Aggressive Assault",
    "details": "If you have the Uchiha Great Assault clan jutsu on your known jutsu list, if you hit a creature with 2 or more unarmed attacks, you instead of dealing unarmed damage can treat the attacks as if you casted the Jutsu at D-Rank at no Cost. Beginning at 9th level, you treat this casting a C-Rank, and B-Rank at 13th level. You may use this feature a number of times equal to your Taijutsu Ability Modifier per short rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Amplified Defense",
    "details": "While you are gaining the benefits of your Sharingan feature, you may make a number of reactions equal to your Sharingan’s Tomoe, per long rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Amplified Flames",
    "details": "When you would cast a Uchiha Clan Hijutsu with the Fire Release Keyword, you reduce the cost by 1 for each Rank. (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5). When you would reach 13th level, you also increase the DC of such jutsu by +1."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Feinting Attack",
    "details": "While you are gaining the benefits of your Sharingan feature, as a Bonus action you select a target. You have advantage on the next attack roll against that creature. If the attack hits, you may add half of your proficiency bonus to the damage done. You may use this feature a number of times equal to your Taijutsu Ability Modifier per short rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan Advancement",
    "details": "You may select 1 additional Sharingan Feature you qualify for. You may take this feature more than once."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Maneuvering Shuriken",
    "details": "If you have the Uchiha Shuriken Rain clan jutsu on your known jutsu list, if you use both your action and bonus action to throw a weapon with the multiattack property, you instead treat it as if you casted the Jutsu at D-Rank at no Chakra Cost. Beginning at 9th level, you treat this casting a C-Rank, and B-Rank at 13th level. You may use this feature a number of times equal to your Taijutsu Ability Modifier per short rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan",
    "details": "One of the Hidden Leaf Village’s 2 great dojutsu. The Sharingan is an eye of extreme potential and flexibility. At 3rd level you gain access to the 1-Tomoe Sharingan. You gain access to more tomoe as you reach higher levels. Activating your Sharingan costs a bonus action and remains active for 10 minutes. You may only use abilities gained from this clan feature while it is active. You can use these abilities three times per Short Rest. You gain an additional uses per Short Rests at 7th and 11th levels. You may spend 10 Chakra while your Sharingan is active to reset the number of uses you have as if you took a short rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "1-Tomoe Sharingan",
    "details": "Starting at 3rd level you gain 30 feet of Chakra sight and two of the following abilities."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Eye of Insight",
    "details": "When you take the Read the Enemy skill action, you can spend a use of this feature to add 1d12 to your check result."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan Adaptation",
    "details": "Select one jutsu type between genjutsu & taijutsu. For the duration of your Sharingan, Your select jutsu casting ability score is changed to the listed Score;\nGenjutsu - Charisma\nTaijutsu - Dexterity"
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan Dodge 1",
    "details": "As a reaction you can, add +3 to your AC until the start of your next turn."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Copy Wheel 1",
    "details": "As a reaction, select one creature you can see casting a jutsu whose rank is equal to or less than your Intelligence (or Wisdom) modifier. This jutsu cannot have the Hijutsu keyword and you cannot copy a ninjutsu with a nature release or the medical keyword if you don’t have access to them. This jutsu is temporarily added to your jutsu list until you either copy another jutsu or take a rest. Alternatively, you can also attempt to learn the jutsu if you succeed on a DC (13 + Jutsu Rank) ability check using the Jutsu’s corresponding ability score (Ninjutsu, Genjutsu, or Taijutsu ability score). On a success you permanently add the jutsu to your known list. On a failure, you don’t learn it and cannot attempt to again until you complete a long rest. You can learn a number of jutsu this way equal to your proficiency bonus. If you attempt to learn a jutsu while you already have the maximum possible learned from this feature, you unlearn one of the jutsu learned this way, replacing it. (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5)"
  },
  {
    "clan": "Uchiha Clan",
    "title": "Genjutsu Counter 1",
    "details": "You are always aware when you are under the effects of a Genjutsu who’s DC is equal to or less than your passive illusion (Illusion bonus + 10) even if the genjutsu has the Unaware keyword. Also, as an Action or Reaction, while under the effects of a Genjutsu you are aware of, you can immediately make an additional saving throw to end their effects."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Hypnotic Eye 1",
    "details": "As a bonus action when you cast Genjutsu: Sharingan!, you can increase the save DC by +1."
  },
  {
    "clan": "Uchiha Clan",
    "title": "2-Tomoe Sharingan",
    "details": "Starting at 7th Level you gain the ability to take the Search Action as a bonus Action and one of the following abilities."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan Dodge 2",
    "details": "You can only take this ability if you already have Sharingan Dodge 1. Your Sharingan Dodge bonus can be applied to Dexterity saving throws."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Aggressive Foresight",
    "details": "As a reaction, you can make an insight check against a hostile creature when they target you or an allied creature within 30 feet of you with a jutsu you can see. (DC: 12+ Jutsu rank (D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5). On a success you become aware of the jutsu being used, its DC, attack bonus, and damage. If you are the target, you gain an additional reaction. If the target is an ally, they gain a +2 AC bonus against this attack as you warn them."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Aggressive Jutsu Augmentation 1",
    "details": "As a Bonus action, when casting a Ninjutsu, Taijutsu or Genjutsu, you may spend additional Chakra equal to half of its total cost to upcast the jutsu by 1 rank, ignoring rank restrictions. If you would attempt to upcast an S-Rank jutsu that deals damage, its damage is increase by 2 damage die or Save DC by +2."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Genjutsu Counter 2",
    "details": "You can only take this ability if you already have Genjutsu Counter 1. You are always aware if you are under the effects of a Genjutsu regardless of the keyword. At the beginning of each of your turns, you can immediately make an additional saving throw to end their effects."
  },
  {
    "clan": "Uchiha Clan",
    "title": "3-Tomoe Sharingan",
    "details": "Starting at 11th level you gain a +5 bonus to your passive perception and one of the following abilities."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Sharingan Dodge 3",
    "details": "You can only take this ability If you already have Sharingan Dodge 2. When targeted by an attack, by spending 10 Chakra as a reaction, you instead can just cause the triggering attack to miss. If you must make a Dexterity saving throw, you can choose to instead succeed taking no damage and suffering no effect. This can only be done if you are not restrained or prone."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Copy Wheel 2",
    "details": "You can only take this Sharingan ability if you have Copy Wheel 1. You can instead learn the jutsu, you’re attempting to copy permanently, if you succeed a DC (15 + Jutsu Rank, D-Rank: 1, C-Rank: 2, B-Rank: 3, A-Rank: 4, S-Rank: 5) ability check using the jutsu’s corresponding ability score (Ninjutsu, Genjutsu, or Taijutsu ability score). On a success you add the Jutsu to your known list. On a failure, you do not copy it, and cannot reattempt to until you complete a long rest."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Aggressive Jutsu Augmentation 2",
    "details": "You can only take this ability If you already have Aggressive Jutsu Augmentation 1. You no longer need to spend additional Chakra to increase the jutsu’s rank by one."
  },
  {
    "clan": "Uchiha Clan",
    "title": "Hypnotic Eye 2",
    "details": "You can only take this ability if you already have Hypnotic Eye 1. As a Bonus Action when you cast a Genjutsu with the Visual Keyword, you can increase the Save DC by +1. If you are casting Genjutsu: Sharingan!, you can increase the save DC by +2."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Ability Score Increase (Uzumaki)",
    "details": "+2 Con, +1 Cha"
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Speed (Uzumaki)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Skill Proficiencies (Uzumaki)",
    "details": "Chakra Control, Ninshou"
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Uzumaki Hijutsu",
    "details": "You know 1 additional Uzumaki clan D-Rank jutsu, this does not count against your jutsu known.\n Uzumaki Features"
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Uzumaki Sealing Techniques",
    "details": "The Uzumaki have access to a separate list of Jutsu unique to their clan. You can add these jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Wellspring of Chakra",
    "details": "Uzumaki’s are known for their massive reserves of Chakra. Beginning at level 1, increase your Chakra point total by 2, thereafter, each time you gain a level, increase your Chakra point total by 2."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Chakra Reserves",
    "details": "Uzumaki’s have a special secondary network of Chakra all their own known as their Chakra reserves. This reserve of Chakra can be call upon at will to slowly revitalize your normal Chakra pool. Starting at 1st level, you materialize this second pool of Chakra, known as Reserve Cells. These cells are a product of this special secondary network allows you to remain fully charged and prepared for battle. You have a number of Reserve Cells equal to your level per long rest. You can spend these cells to accomplish any of the following;\n As a bonus action, you can spend any number of cells, regaining 1d8 Chakra points, per cell spent. This increases to a d10 at 11th level.\n When you would take a rest, you can spend up to two cells to regain additional +2 Chakra per chakra die rolled.\n Beginning at 7th level, when you would take Chakra damage, you can, as a reaction, spend up to 3 cells to reduce damage taken by an amount equal to 1d10 + constitution, per cell spent."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Fuinjutsu Master",
    "details": "Also at 1st level, Uzumaki can utilize jutsu with the Fuinjutsu keyword far better than most. One per rest, you can cast a jutsu you know with the Fuinjutsu keyword that has a casting time of 1 action, as a bonus action. This increases to twice per rest at 11th level and three times per rest at 18th level."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Fundamental Difference",
    "details": "Uzumaki’s are known for their incomprehensible stamina and they have adapted it to allow them to magnify their sealing Techniques. Beginning at 3rd Level, you may use Constitution instead of Intelligence for the Attack and damage rolls as well as Save DC of Ninjutsu you cast with the Fuinjutsu Keyword."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Draining Seals",
    "details": "Starting at 3rd level, when a creature gains any number of ranks of the Sealed condition, they increase the cost of their next jutsu by +2 for each rank of Sealed they gained. Beginning at 7th level when a creature would fail a saving throw against a Jutsu you cast with the Fuinjutsu keyword, they take Chakra damage equal to the rank of the Fuinjutsu cast. (D-Rank: 10, C-Rank: 15, B-Rank: 20, A-Rank: 25, S-Rank: 30). Finally at 15th level, creatures with ranks of the Sealed condition that passes their saving throw vs a Fuinjutsu you cast takes half of the listed chakra damage this feature deals."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Inhuman Lifeforce",
    "details": "Uzumaki’s are known for having life forces that rival that of legendary shinobi. Starting at 11th level, you gain proficiency in Constitution saving throws. If you are already proficient you instead gain a +2 bonus to Constitution saving throws."
  },
  {
    "clan": "Uzumaki Clan",
    "title": "Incomprehensible Fortitude",
    "details": "At 18th level, once per long rest, when you make a Constitution Saving throw, you may choose to automatically succeed. When you do, you ignore the effects of the Jutsu or ability that caused you to make the constitution save until the beginning of your next turn."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Ability Score Increase (Yamanaka)",
    "details": "+2 Wis or Cha, +1 Int"
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Speed (Yamanaka)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Skill Proficiencies (Yamanaka)",
    "details": "Illusions, Insight"
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Yamanaka Hijutsu",
    "details": "You know 1 additional Yamanaka Clan D-Rank Jutsu.\n Yamanaka Features"
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Yamanaka Techniques",
    "details": "The Yamanaka have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Mental Connections",
    "details": "Beginning at 1st level, Yamanaka clan jutsu you cast can use Charisma in place of Wisdom as their Genjutsu ability modifier."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Mental Boon",
    "details": "Beginning at 3rd level, your experience with Yamanaka Jutsu grows. You gain 1 Mental Boon of your choice. Your boon options are detailed at the end of the Clan description. You gain an additional boon, at 7th, 11th, 15th and 18th levels. Each time you gain a level, you can choose one of the boons you know and replace it with another boon you qualify for."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Mental Clarity",
    "details": "The Yamanaka are adept at mind control, suggestion, alteration, and affliction, making them far more suited to resist such attempts. Starting at 7th level, you gain a 1d4 bonus to all saving throws against Genjutsu with the Unaware keyword, and advantage on Insight checks against creatures attempting to lie to you.\n \n \n Beginning at 11th level as a bonus action, you can target one creature you can see within 60 feet and make a Wisdom or Charisma (Insight) check vs a DC (8 + their level) to learn either the targets Wisdom or Charisma score. You can do this a number of times equal to your proficiency bonus per long rest."
  },
  {
    "clan": "Yamanaka Clan",
    "title": "Master of Mental Alteration",
    "details": "Yamanaka are masters of mental afflictions and alterations. Starting 11th level, when a creature would critically fail a saving throw against a Genjutsu you cast, you can inflict them with one a unique Mental condition known as Stupefied. A Stupefied creature suffers the following effects.\n A stupefied creature suffers a -1 penalty to all Intelligence based ability checks, skill checks, attack rolls, and saving throws.\n A stupefied creature increases the cost of jutsu they cast by +2.\n A stupefied creature cannot concentrate on more than one jutsu at a time.\n A stupefied creature can be afflicted further with multiple applications of this condition. If a stupefied creature suffers another rank of stupefied. They suffer another penalty to Intelligence based ability checks, skill checks, attack rolls and saving throws and further increase the cost of jutsu they cast.\n At the end of a stupefied creatures turn, they make a DC 15 check Wisdom ability check ending this condition on a success."
  },
  {
    "clan": "Yoton Clan",
    "title": "Ability Score Increase (Yoton)",
    "details": "+2 Int, +1 Con"
  },
  {
    "clan": "Yoton Clan",
    "title": "Speed (Yoton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Yoton Clan",
    "title": "Skill Proficiencies (Yoton)",
    "details": "Nature, Survival"
  },
  {
    "clan": "Yoton Clan",
    "title": "Lava Release Affinity",
    "details": "You begin with either Earth or Fire Release Affinity. (Pick one)\n Yoton Features"
  },
  {
    "clan": "Yoton Clan",
    "title": "Lava Techniques",
    "details": "The Yoton clan has access to a separate list of jutsu unique to their clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list(s). They do not need both nature releases to use their clan jutsu."
  },
  {
    "clan": "Yoton Clan",
    "title": "Calcified Skin",
    "details": "Beginning, at 1st level, your molten Chakra has reinforced your physical body, making it tougher than most other shinobi of similar capability. While wearing no armor or light armor, you gain 4 DR (damage reduction) vs bludgeoning, piercing or slashing damage. Beginning at 11th level, this DR increases to 6 and becomes 10 at 18th level."
  },
  {
    "clan": "Yoton Clan",
    "title": "Churning Magma",
    "details": "Beginning at 3rd level, your Chakra has the same density and heat produced by lava itself granting you a slight resiliency to such damage. When you would take Fire damage, you reduce the damage received by your proficiency bonus. When you would reach 11th level, your magma release can evolve a creatures burned condition to a new level, called Molten. When a creature with 5 ranks of the burned condition would gain another rank of the burned condition, they instead become Molten, losing all ranks of burned as it is replaced with 1 rank of Molten. A Molten creature suffers the following effects.\n A Molten creature is counted as burned for the purposes of interacting with features, traits and jutsu and cannot gain ranks of the burned or Chilled condition while they are Molten.\n A Molten creature takes 5d8 Fire damage at the beginning of each of their turns.\n Once per turn, a molten creature takes an additional 15 Earth damage when they would take Earth damage.\n Creatures that are immune to both Fire and Earth damage is immune to this condition.\n A creature can spend an Action to make a DC 21 Dexterity save to put out the flames. On a successful save, the condition ends or submerging themselves fully into a body of Water.."
  },
  {
    "clan": "Yoton Clan",
    "title": "Lava Release",
    "details": "The Yoton bloodline has a unique talent for manifesting lava release, due to their close affinity to both Earth and Fire Release. Beginning at 7th level, you gain the second nature release you didn’t select from Lava Release Affinity and you can safely walk across Lava and other dangerous hazards without sustaining harmful effects while Water walking. Also, at 7th level, when you would cast a jutsu with either Earth or Fire Release keywords that would deal damage, you can change the damage type to Fire. Also, once per casting, when using a Yoton Hijutsu or Ninjutsu with the Earth or Fire release keyword, it can take up to two qualities of the following, each time you cast such a jutsu. You can use this feature to enhance your jutsu a number of times equal to your proficiency bonus per long rest:\n• Molten Rock - Increase your jutsu’s damage by +1 damage die. This bonus increases to +2 at 15th level.\n • Acidic Mud - A creature who takes damage from or fails a saving throw from a jutsu cast, they gain 1 rank of corroded.\n • Corrosive Quicklime - As a part of casting this jutsu, you may force an affected creature to make a Strength saving throw. On a failed save the target creature(s) become restrained, as they are frozen in place by hardening lava. They can remake their save at the end of each of their turns to end the restrained condition inflicted by this feature.\n • Vulcanized Rubber - When you would summon a structure or Earthen construct you can reinforce it, making it resistant to Lightning damage and giving it bonus hit points or temporary hit points equal to twice your proficiency bonus.\n • Malleable Onyx - Malleable Onyx [Changed]: As part of the same action used to cast a jutsu that would create a construct or structure meant to intercept damage for you or another creature you may comprise it entirely of onyx. The structure gains 8 DR vs all damage. This increases to 12 at 11th level and 16 at 18th level."
  },
  {
    "clan": "Yoton Clan",
    "title": "Molten Core",
    "details": "Beginning at 18th level, you ignore treat immunity to Fire damage as resistance, and creatures of your choice who would begin their turns within 10 feet of you take Fire damage equal to half your level. This ignores DR (damage reduction)."
  },
  {
    "clan": "Yuki Clan",
    "title": "Ability Score Increase (Yuki)",
    "details": "+2 Dex or Int, +1 Int or Cha (Int cannot be chosen as the +1 ASI, if it was chosen for the +2 ASI.)"
  },
  {
    "clan": "Yuki Clan",
    "title": "Speed (Yuki)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Yuki Clan",
    "title": "Skill Proficiencies (Yuki)",
    "details": "Chakra Control, Ninshou"
  },
  {
    "clan": "Yuki Clan",
    "title": "Ice Release Affinity",
    "details": "You begin with either Wind or Water Release Affinity. (Pick one)\n Yuki Features"
  },
  {
    "clan": "Yuki Clan",
    "title": "Ice Techniques",
    "details": "The Yuki clan have access to a separate list of Jutsu unique to their clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list(s). They do not need any Nature Release to use their clan jutsu."
  },
  {
    "clan": "Yuki Clan",
    "title": "Frigid Cold",
    "details": "Beginning at 1st level, your ability to produce a combination of Wind and Water release takes shape. As a Bonus action, you can freeze over the surface you are standing on within a 15-foot radius of yourself. You can do this twice per rest. This increases to three times and the size of this feature increases to 30 feet at 7th level, and four times and the size of this feature increases to 45 feet at 15th level. This frozen surface counts as difficult terrain for other creatures, but not for you. If you freeze over a liquid surface, it can be converted back to whatever liquid it was prior when you would cast a jutsu with the Water Release keyword that can gain additional benefits from being near a sufficient source of Water. When you would reach 3rd level you can choose to liquify and refreeze the water as your allies move across it. When you do, your allies are immune to the frozen surfaces difficult terrain effect.\n Starting at 3rd level, when you deal cold damage to a creature, you can choose to spend a use of this feature to freeze up to a 15-foot sphere of the environment around the target, extinguishing any fire, freezing any liquid and creating a layer of ice over the surround area. This area is treated as difficult terrain and creatures who end their turn in this area must make a Constitution saving throw vs your Ninjutsu save DC. On a failed save, they gain 1 rank of Chilled. This frozen area melts at the beginning of your next turn.\n Beginning at 7th level, creatures who fail their Constitution saving throw vs this features effect suffers the damage effect of all ranks of chilled they have and if they fail by 5 or more they also gain 1 rank of Bruised as the frost begins to bite into their muscles.\n Beginning at 15th level, creatures with ranks of chilled, who would make their saving throw vs this effect, suffer a -2 penalty to its save."
  },
  {
    "clan": "Yuki Clan",
    "title": "Chilled Body",
    "details": "Beginning at 3rd level you have a high resistance to both extreme heat and cold, finding frigid weather rather inviting as you gain the following benefits; Your body can no longer be detected by heat sensing methods, you gain DR (damage reduction) vs Fire damage equal to your proficiency bonus, and you gain resistance to cold damage.\n Beginning at 11th level you gain immunity to the Chilled condition and beginning at 18th level evolves as you gain immunity to cold damage and effects caused by jutsu that deals cold damage."
  },
  {
    "clan": "Yuki Clan",
    "title": "Ice Release",
    "details": "The Yuki clan has a unique talent for manifesting Ice Release due to their close affinity to both Water and Wind Release. Beginning at 7th level, you gain the second Nature release you didn’t select from Ice Release Affinity clan trait. Also, at 7th level, when casting a jutsu with either Wind or Water Release keywords, you can change the damage type to cold and twice per casting, whenever you would deal cold damage you can add your Ninjutsu ability modifier to the damage rolled.\n Beginning at 11th level, your ice release can evolve a creatures chilled condition to a new level, called Frostbite. When a creature with 5 ranks of the chilled condition would gain another rank of the chilled condition, they instead become Frostbitten, losing all ranks of chilled as it is replaced with 1 rank of Frostbite. A Frostbitten creature suffers the following effects.\n A Frostbitten creature is counted as five ranks of Chilled for the purposes of interacting with features, traits and jutsu and cannot gain ranks of Chilled while they are Frostbitten.\n A Frostbitten creature remains Frostbitten for 10 minutes.\n A Frostbitten creature takes 5d6 cold damage whenever they would move any number of feet or cast a Jutsu that requires the Mobility (M) component.\n A Frostbitten creature cannot cast Jutsu with the Hand Seal (HS) component.\n A Frostbitten creatures speed is reduced to 5 feet and they cannot gain bonuses to speed for the duration.\n A Frostbitten creature takes a -5 penalty to Dexterity saving throws, ability checks and skill check"
  },
  {
    "clan": "Chinoike Clan",
    "title": "Ability Score Increase (Chinoike)",
    "details": "+2 Wis or Int, +1 Dex"
  },
  {
    "clan": "Chinoike Clan",
    "title": "Speed (Chinoike)",
    "details": "You base walking speed is 30 feet."
  },
  {
    "clan": "Chinoike Clan",
    "title": "Skill Proficiencies (Chinoike)",
    "details": "Illusions, pick one Chakra Control or Ninshou"
  },
  {
    "clan": "Chinoike Clan",
    "title": "Passive Affinity (Chinoike)",
    "details": "You begin with the Water release affinity.\n Chinoike Features"
  },
  {
    "clan": "Chinoike Clan",
    "title": "Chinoike Techniques",
    "details": "The Chinoike have access to a separate list of Jutsu unique to their Clan. You can add these jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list."
  },
  {
    "clan": "Chinoike Clan",
    "title": "Sanguine Prowess",
    "details": "Beginning at 1st level, you begin to understand how to manipulate iron present in liquids and develop an affinity towards techniques with blood. When you would cast a jutsu with the Water Release keyword, as part of the same action, you can cut yourself and release a small amount of blood, losing 1d4 hit points (this does not count as damage). In exchange, the jutsu cast gains the benefit of being near a sufficient source of water, if applicable. If not applicable, reduce the cost of the jutsu by -2 (Min. 1).\n Starting at 3rd level, your control over blood in conjunction with water release chakra improves, becoming far more complex and intricate. When a jutsu would benefit from this feature, you can grant the jutsu, once per casting, an additional die of damage, healing, or a +1 to Save DC. At 11th level, you can pick a 2nd benefit, or one benefit twice."
  },
  {
    "clan": "Chinoike Clan",
    "title": "Ketsuryūgan",
    "details": "The fabled Ketsuryūgan of the Chinoike clan, this haunting Dojutsu is able to manipulate the blood of the enemies of the Chinoike clan to destroy\n them upon the inside. This eye is also the catalyst for incredible genjutsu that rivals the Sharingan in power.\n Beginning at 3rd level, you can as a bonus action spend 5 chakra to activate this mythical Dojutsu for 10 minutes. While this eye is\n active, you have resistance to necrotic damage and advantage against the bleeding condition. Additionally, whenever you deal cold damage, you can change the damage type to necrotic.\n Starting at 7th level, your eye improves the circulation of blood. You become immune to the bleeding condition, and creatures that you apply the bleeding condition to increase the damage die of the bleeding condition by 1 step, up to the maximum of a d12.\n Starting at 15th level, when a creature takes damage from the bleeding condition that was inflicted by you, they take an additional amount of flat damage equal to the ranks of bleeding they possess.\n For the duration of your Ketsuryūgan, you can take the following actions; You can use these clan features a number of times equal to your proficiency bonus per long rest.\n• Action - You can supercharge the circulation of blood within yourself and allied creatures within a 15-foot radius of you until the end of your next turn. All affected creatures gain a +1 to AC, attack rolls and damage rolls. They also gain a +15 bonus to movement speed. Starting at 7th level, affected creatures increase their critical threat range by +1 for all attacks and gain an additional reaction, which can only be used to make one unarmed or weapon attack, or take an attack of opportunity.\n • Bonus Action - When you cast a jutsu with the Water Release keyword, you can use the prowess of the Ketsuryūgan to mold the excess chakra of the jutsu to improve your defense and drain the life force of enemies. You gain temporary hit points equal to your jutsu's Save DC for the next minute, and if your jutsu deals damage with an attack or failed saving throw, its damage becomes necrotic and you recover Xd4 hit points on a hit or failed save, once per casting, where X is equal to the number of damage die used in the jutsu. (Ex. Dealing 6d10 damage recovers 6d4 hit points). If the creature is resistant to your damage, halve the amount gained.\n • Reaction - You improve the flow of blood within the brain to enhance you or an allies mental acuity to defend against attacks of the mind. When you or an allied creature within 30 feet would fail an Intelligence, Wisdom, or Charisma saving throw, you can grant the creature a bonus to these types of saving throws equal to your Wisdom or Intelligence modifier (Pick one). \n At 7th level, the affected creature gains advantage on rolls to resist Mental and Sensory conditions, and resistance to psychic damage, until the end of their next turn. Starting at 18th level, when you would fail a saving throw against a genjutsu, you can choose to automatically succeed, suffering no damage or effects."
  },
  {
    "clan": "Chinoike Clan",
    "title": "Blood Pact",
    "details": "Starting at 7th level, by leaving traces of your blood within your allies, you can form a bond with one another, your blood acting like an aegis.\n During a long rest, you and one willing creature can spend 1 hit die each to transfuse each other’s blood into yourselves. The allied creature becomes known as your Patron. While bonded to a creature this way, you both gain the following benefits until both of you complete a full rest; At 15th level, you can have a 2nd Patron.\n You know if you and your Patron are within 1 mile of each other. You also know if they are dead or out of chakra.\n You and your Patron are aware of any negative conditions affecting each other, provided you are both within 1 mile.\n When either you or your Patron would receive healing from a medical jutsu, the creature in question can use their reaction to split the healing between one another, as long as you both are within 90 feet of each other.\n Your Patron adds half your Wisdom or Intelligence modifier (pick one), rounded up, to any death saving throws. If your Patron would automatically fail a death saving throw, they instead roll another saving throw, rather than immediately fail.\n Lastly, if a creature would attempt to read the mind or force one of your Patrons to give information or act against their will, the triggering creature(s) must make a Charisma saving throw against your Genjutsu Save DC. On a failed save, the creature sees the eyes of your Ketsuryūgan appear and they immediately take Xd10 psychic damage, where X equals your proficiency bonus. The jutsu or ability which triggered this feature, immediately fails. Affected creatures who are unprepared for this effect, are surprised. Once this ability activates, your Blood Pact with this Patron ends."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Ability Score Increase (Fūshin)",
    "details": "+2 Int, +1 Dex"
  },
  {
    "clan": "Fūshin Clan",
    "title": "Speed (Fūshin)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Skill Proficiencies (Fūshin)",
    "details": "Ninshou, Chakra Control"
  },
  {
    "clan": "Fūshin Clan",
    "title": "Passive Affinity (Fūshin)",
    "details": "You have the Wind Release Affinity."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Wind Literacy",
    "details": "Your Ninjutsu ability score is counted as being +2 higher, for the purpose of qualifying for jutsu of B-Rank or Higher with the Wind Release Keyword.\n Fūshin Features"
  },
  {
    "clan": "Fūshin Clan",
    "title": "Typhoon Techniques",
    "details": "The Fūshin have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Wind Release Simplicity",
    "details": "Starting at 1st level, when creating or learning Ninjutsu with the Wind Release Affinity reduce the time it takes to complete the task by half. This does not stack with other similar effects."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Go With The Flow",
    "details": "Beginning at 1st level, when you cast a Ninjutsu with the Wind Release keyword, you ignore half cover. Also at 1st level, you reduce falling damage by half as the wind naturally protects you. Starting at 11th level, you also ignore ¾'s cover.\n Also at 11th level, you can spend your reaction to take no damage from fall as you are cradled in a collection of wind."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Raging Tempest",
    "details": "Beginning at 3rd level, your wind has started to wander, almost gaining a mind of its own. When you would cast a Ninjutsu with the Wind Release Keyword, that has an area of effect, you may increase the area by 5 feet in every direction. Starting at 18th level, this increases by an additional 10 feet and you may also double the range of the jutsu."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Swirling Cyclone",
    "details": "Beginning at 3rd level, your ability to control the currents and direction of wind is enhanced tremendously due to your Typhoon Release. When you cast a Ninjutsu with the Wind Release keyword that does not utilize the Swirl mechanic, you may spend 3 chakra to give it this mechanic, once per casting.\n Alternatively, you may also choose to remove the Swirl mechanic if the jutsu possesses it. If you do, reduce the cost of the jutsu by -1 instead.\n Beginning at 18th level, all Fushin Hijutsu may gain the benefits of this feature at no additional cost, and increase the radius of Swirl by 5 feet."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Typhoon Release",
    "details": "The Fūshin clan has a unique talent for manifesting Typhoon Release, a powerful variant of Wind Release that tears through most defensives. Beginning at 7th level, when casting a Ninjutsu with Wind Release Keyword, you can change the damage type to wind, and you increase your jutsu's damage die by 1 step. (d4->d6->d8->d10->d12)\n Beginning at 15th level, once per turn, when you would deal wind damage, you inflict 1 rank of bleed."
  },
  {
    "clan": "Fūshin Clan",
    "title": "Forceful Gale",
    "details": "Also, at 7th level, your wind moves at such speeds that it tears through most defenses. Your wind damage ignores resistance and disperses vapors, gases, and fogs that can be dispersed by strong winds.\n At 11th level, your wind's speed is unmatched, once per rest, when a creature would cast a Reaction against a wind release jutsu you cast, you can force them to make a Dexterity saving throw against the jutsu save DC, being unable to take their reaction on a failed save.\n At 15th level, after you have used this feature, you may spend 5 chakra to use it again. A jutsu can only force this save once per casting."
  },
  {
    "clan": "Genwa Clan",
    "title": "Ability Score Increase (Genwa)",
    "details": "+2 Int, +1 Dex"
  },
  {
    "clan": "Genwa Clan",
    "title": "Speed (Genwa)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Genwa Clan",
    "title": "Skill Proficiencies (Genwa)",
    "details": "Ninshou, Sleight of Hand"
  },
  {
    "clan": "Genwa Clan",
    "title": "Extra Language (Genwa)",
    "details": "Machine-Speak. You can understand and communicate with machines."
  },
  {
    "clan": "Genwa Clan",
    "title": "Passive Affinity (Genwa)",
    "details": "You have the Lightning Release Affinity."
  },
  {
    "clan": "Genwa Clan",
    "title": "Genwa Clan Jutsu",
    "details": "The Genwa Clan has access to a separate list of jutsu unique to their clan. You can add these jutsu to your jutsu list instead of selecting jutsu from the normal jutsu list(s)."
  },
  {
    "clan": "Genwa Clan",
    "title": "1s and 0s",
    "details": "Starting at 1st level, you are a natural wiz when it comes to machines. You gain proficiency in the Hacker and Security kits. You also always count as possessing a Radio Link, and your signal cannot be interfered with or traced using ninja tools.\n Starting at 3rd level, you ignore penalties and have advantage on checks made with the Hacker and Security kits. When you would need one of these kits but do not have one or have any remaining charges, you can spend 5 chakra to temporarily create the kit for 1 minute and can spend 2 chakra to create/replenish any charges.\nStarting at 7th level, you can read the data stored within Recording Scrolls, Data Scrolls, and Data Server Scrolls just by touching them. Additionally, you can spend 1 chakra die to attempt to create a keycard out of pure data release. Make a Ninshou check vs. a DC equal to 8 + a rank of your choosing. On a success, you create a keycard that lasts for 1 day, able to open doors in facilities equal to or lower than the rank you choose, a number of times equal to half your proficiency bonus, rounded up, before dispersing. This can even open doors that are not technological. (E-Rank 2, D-Rank: 5, C-Rank: 9, B-Rank: 13, A-Rank: 17, S-Rank: 21))"
  },
  {
    "clan": "Genwa Clan",
    "title": "Stable Frequency",
    "details": "Starting at 1st level, you learn how to use electricity to increase the range and depth perception of Sensory jutsu. Select a number of jutsu you have known with the Sensory keyword equal to your proficiency bonus. These jutsu gain the Lightning Release keyword.\n When you cast a Genwa Hijutsu or jutsu with the Sensory and Lightning Release keywords, that requires concentration, you can double the jutsu's cost to change the duration to 1 minute, without concentration, though you can end the jutsu early as a bonus action. You can only benefit from this feature once at a given time."
  },
  {
    "clan": "Genwa Clan",
    "title": "Data Channels",
    "details": "Starting at 3rd level, you have learned to tap into the frequencies of various Shinobi networks across the 5 great nations, gathering new covert information which you are able to use to improve your own abilities; like free lessons. You gain 2 Data Channels as shown on the Data Channel table. You gain an additional Data Channel at 11th, 15th, and 18th levels."
  },
  {
    "clan": "Genwa Clan",
    "title": "Data Release",
    "details": "The Genwa have a unique talent for manifesting Data Release, due to their close affinity to Lightning release. Starting at 7th level, when you cast a jutsu with the Lightning release keyword, you can change the damage type to force and increase the damage dealt by 1 step or Save DC by +1, once per casting.\n Starting at 11th level, when you affect a creature with a Genwa Hijutsu, you can perform a Data Leak on the creature. When you do, you data mine 2 of the following pieces of information, the data being displayed above their head as floating text that only you can see. You can perform a Data Leak twice per long rest. At 18th level, this feature resets on a short rest.\n Two of the creature's attack bonuses.\n Two of the creature's saving throw bonuses.\n Two of the creature's Save DCs.\n The amount of hit and chakra points the creature has lost.\n Number of Tenacity Die/\n Legendary Resistances.\n All General, Role,\n or Clan Traits\n (Pick one)\n \n Data Channels"
  },
  {
    "clan": "Hoshi Clan",
    "title": "Ability Score Increase (Hoshi)",
    "details": "+2 Con, +1 Int"
  },
  {
    "clan": "Hoshi Clan",
    "title": "Speed (Hoshi)",
    "details": "Your base walking speed is 30 feet"
  },
  {
    "clan": "Hoshi Clan",
    "title": "Skill Proficiency (Hoshi)",
    "details": "Chakra Control, Ninshou"
  },
  {
    "clan": "Hoshi Clan",
    "title": "Hoshi Clan Jutsu",
    "details": "You learn 1 additional D-Rank Hoshi Clan Hijutsu. This does not count against your jutsu known.\n Hoshi Features"
  },
  {
    "clan": "Hoshi Clan",
    "title": "Hoshi Techniques",
    "details": "The Hoshi Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Hoshi Clan",
    "title": "Meteoric Casting",
    "details": "Starting at 1st level, you may use Constitution instead of Intelligence for the Attack and Damage rolls as well as Save DC of Hoshi Hijutsu."
  },
  {
    "clan": "Hoshi Clan",
    "title": "Star Chakra",
    "details": "Also at 1st level, you've begun the process of absorbing meteoric chakra into your own chakra network. This process grants you access to a unique source of chakra, called Star Chakra, which can be used in place of regular chakra to fuel jutsu or features. You have a maximum pool of Star Chakra equal to your constitution modifier (min 1) + your level. You regain a number of Star Chakra equal to your Con mod after a short rest, and all Star Chakra after a long or full rest.\n Star Chakra cannot be absorbed, damaged, or reduced by hostile effects. Jutsu cast using Star Chakra cannot be dispelled by a rank equal to or less than the jutsu cast, and if it has the Clash keyword it gains a bonus to its clash check equal to your Constitution modifier.\n \n \n \n At 7th level, you begin harnessing the malleable nature of Star Chakra. When you cast a jutsu, except Hoshi hijutsu, using Star Chakra, reduce the cost of that jutsu by -1 for every 1 Star Chakra used in its casting. You cannot reduce a jutsu's cost by more than your Constitution modifier this way.\n Also at 7th level, once per turn, when you cast a Hoshi Hijutsu using only its Star Chakra cost, it deals an additional die of force damage. At 15th level, it deals +2 extra dice."
  },
  {
    "clan": "Hoshi Clan",
    "title": "Celestial Body",
    "details": "The land of bears breed mighty shinobi, and due to this vitality you're able to integrate Star Chakra throughout your entire chakra network. Starting at 3rd level, you have resistance to Chakra Damage. Effects that would reduce your chakra are halved, and if an effect would allow a creature to absorb chakra as a result of damaging or reducing your own, that creature instead takes force damage equal to the amount it would have gained.\n At 15th level, Star Chakra has overcharged your\n natural resilience, granting you advantage on\n Constitution saving throws against jutsu and\n conditions."
  },
  {
    "clan": "Hoshi Clan",
    "title": "Kujaku Mode",
    "details": "Also at 3rd level, as a bonus action you can activate this unique chakra mode twice per long rest. Your body becomes wreathed by a manifestation of translucent chakra shaped similar to a peacock's tail feathers, which unfurl on either side of you. Kujaku Mode lasts for 1 min or until you dismiss it (no action). You can activate this mode an additional time per long rest at 11th and 18th levels. For the duration this mode\n is active you gain the following benefits:\n You gain temp hit points equal to your Star Chakra total.\n Chakra Control checks you make add a 1d4 bonus. At 11th level, this becomes 1d6, and then 1d8 at 18th level.\n When making a Strength check you can spend 2 Star Chakra to make a Chakra Control check instead.\n Hoshi Hijutsu you cast ignore Hand Sign components and gain a +1 bonus to its attack roll(s) OR Save DC\n (your choice) if it was cast using its Star Chakra cost.\n Increase your AC by +1. When you take damage, as a reaction you can spend 1 chakra die and reduce the damage taken by an amount equal to the die result + your Level. At 18th level, this adds your Constitution modifier."
  },
  {
    "clan": "Iburi Clan",
    "title": "Ability Score Increase (Iburi)",
    "details": "+2 Int, +1 Con"
  },
  {
    "clan": "Iburi Clan",
    "title": "Speed (Iburi)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Iburi Clan",
    "title": "Skill Proficiencies (Iburi)",
    "details": "Chakra Control, Survival"
  },
  {
    "clan": "Iburi Clan",
    "title": "Passive Affinity (Iburi)",
    "details": "You begin with the Fire release affinity."
  },
  {
    "clan": "Iburi Clan",
    "title": "Fire Literacy",
    "details": "Your Ninjutsu ability score is counted as being +2 higher, for the purpose of casting jutsu of B-Rank or higher with the Fire Release Keyword through any ability score restrictions (SHB, pg.104). Iburi Features"
  },
  {
    "clan": "Iburi Clan",
    "title": "Iburi Techniques",
    "details": "The Iburi Have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Iburi Clan",
    "title": "Fire Release Simplicity",
    "details": "When creating or learning Ninjutsu with the Fire Release affinity, reduce the time it takes to complete the task by half. This does not stack with other similar effects."
  },
  {
    "clan": "Iburi Clan",
    "title": "Ashen Resilience",
    "details": "Starting at 1st level, your clan's unique kekkei genkai grants you the ability to control\n the smoke within and nearby your body. Whenever\n you take knockback, the distance is always halved.\n You also add a +1d4 bonus to saving throws against Genjutsu with the Inhale keyword, as your smoke\n body naturally filters out toxins.\n Starting at 3rd level, your body becomes more tolerant to flame. Whenever you take fire damage, you reduce the damage taken by -3. At 7th level, your resilience to\n fire improves. You gain resistance to fire damage.\n Starting at 11th level, you gain immunity to the\n Burned condition and you can attempt to end the\n Burned condition on an allied creature within 15\n feet of you as a bonus action. When you attempt the Survival skill check to end the Burned condition, you make your check at advantage."
  },
  {
    "clan": "Iburi Clan",
    "title": "Will-O-Wisps",
    "details": "Starting at 3rd level, your clan's kekkei genkai grants you unparalleled control over the smoke created by fire. When you target a creature with a jutsu with the Fire Release keyword that requires an attack roll, you can spread the smoke and cinders produced by the fire to creatures within 5 feet of the original target, excluding you and the target. Each creature that would be affected must make a Dexterity saving throw, taking half the damage dealt to the original target on a failed save, or none on a success.\n The range of this effect increases to 10 feet at 11th level. You can use this feature a number of times equal to half your proficiency bonus, rounded up, per long rest. At 15th level, this becomes your full proficiency bonus."
  },
  {
    "clan": "Iburi Clan",
    "title": "Aberration of Smoke",
    "details": "Starting at 7th level, you begin to weave the remnants of smoke from Fire jutsu you cast into yourself, allowing you to quickly maneuver around the battlefield like a gust of ash. As a bonus action, you can briefly morph your body into smoke and move to a location within 10 feet, without provoking an attack of opportunity. You can also use this feature after casting a jutsu with the Fire Release keyword by spending 3 chakra. You can use this ability no more than once per round.\n The range you can move with this feature increases to 15ft at 11th level and at 18th level, when you use this feature, your AC increases by +1 until the start of your next turn."
  },
  {
    "clan": "Iburi Clan",
    "title": "Smoke Release",
    "details": "The Iburi clan has a unique talent of manifesting Smoke Release, an augmentative release that improves the area of effect of fire, and its destructive capabilities. Starting at 7th level, when you cast a jutsu with the Fire Release Keyword, you can give affected creatures a -2 penalty to one saving throw against the jutsu or your Will-O-Wisps feature.\n Beginning at 15th level, twice per rest, when you deal Fire damage, you automatically blind all affected creatures until the end of each of their turns."
  },
  {
    "clan": "Kashu Clan",
    "title": "Ability Score Increase (Kashu)",
    "details": "+2 Int, +1 Wis"
  },
  {
    "clan": "Kashu Clan",
    "title": "Speed (Kashu)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Kashu Clan",
    "title": "Skill Proficiencies (Kashu)",
    "details": "Illusions, Survival"
  },
  {
    "clan": "Kashu Clan",
    "title": "Kashu Hijutsu",
    "details": "You know 1 additional Kashu Clan D-Rank Hijutsu, this does not count against your jutsu known."
  },
  {
    "clan": "Kashu Clan",
    "title": "Auditory Literacy",
    "details": "All ability scores are counted as being +2 higher, for the purpose of casting Higher Ranked Genjutsu with the Auditory Keyword through any Ability Score Restrictions.\n Kashu Features"
  },
  {
    "clan": "Kashu Clan",
    "title": "Kashu Sound Techniques",
    "details": "The Kashu Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Kashu Clan",
    "title": "Auditory Weaponry",
    "details": "Beginning at 1st level, when you would benefit from a short or long rest, you can craft a single auditory ninja tool that will serve as a component for your Kashu Clan Hijutsu. This Auditory Ninja Tool is a simple melee weapon with the Light and Finesse properties and deals 1d4 Bludgeoning damage. This tool can be of any description the user wants, but it must be a device that can produce sound. While wielding this tool you gain a +1 to damage rolls with Genjutsu with the Auditory keyword, this increases to +2 at 7th level, and +3 at 15th level.\n Starting at 3rd level, when you cast a Genjutsu with the Auditory keyword, you can add your Auditory Ninja Tool as a component. When you do, you can increase the damage dealt by 1 die, or decrease the cost of the jutsu by half the result of 1d4 (rounded up).\n Starting at 11th level, when you would cast a Genjutsu with your Auditory Ninja Tool as a component, your Genjutsu is able to ignore immunity that a creature would have as a result of being deafened."
  },
  {
    "clan": "Kashu Clan",
    "title": "Disorienting Chords",
    "details": "Beginning at 1st level, you gain access to a new Sensory condition known as Disorientation, A creature suffering from disorientation finds difficulty balancing themself and performing feats of agility. They also feel a deep illness akin to motion sickness.\n A creature with any ranks of Disorientation suffers the following effects; A creature can have up to 5 ranks of Disorientation.\n For each rank of Disorientation a creature has, they suffer a -1 penalty to checks, saving throws, and attack rolls that rely on Dexterity.\n A creature with 3 ranks or more of Disorientation has disadvantage on all saving throws and attack rolls that rely on Dexterity.\n A creature with 5 ranks of Disorientation falls prone and cannot stand up.\n A creature immune to the Weakened condition is also immune to this condition.\n A creature that is affected by 1 or more ranks of Disorientation can attempt to remove them. As an action on an affected creatures turn, they can make a DC 15 Wisdom saving throw to remove all ranks of Disorientation on themselves.\n At 15th level, the DC to remove Disorientation increases to 20. Additionally, twice per long rest, when a creature fails a saving throw against a Genjutsu you cast, you can give them 1 rank of Disorientation."
  },
  {
    "clan": "Kashu Clan",
    "title": "Cunning Genjutsu",
    "details": "Beginning at 3rd level you master the technical applications of Kashu Hijutsu. You may use Intelligence in place of Wisdom for the Attack and Damage rolls and Save DC of Kashu Hijutsu you cast."
  },
  {
    "clan": "Kashu Clan",
    "title": "Precise Performance (Changed)",
    "details": "Starting at 7th level, you gain a +1 bonus to your Genjutsu attack bonus when using Genjutsu with the Auditory keyword. This increases to +2 at 15th level.\n Also at 7th level, when you would cast a Genjutsu that does not have the Auditory keyword, you can spend increments of 3 chakra to remove one sensory keyword from the genjutsu, excluding the tactile keyword. If you remove all other sensory keywords this way, the jutsu gains the Auditory keyword."
  },
  {
    "clan": "Kashu Clan",
    "title": "Reckless Genjutsu",
    "details": "Kashu Clan members are able to furiously cast genjutsu at the cost of effectiveness with the intent to butcher their enemies. Beginning at 11th level, as long as you are equipped with your Auditory Ninja Tool, when you would cast a genjutsu with the auditory keyword that does damage and requires a saving throw you can reduce your Save DC by 1, up to 3 times and increase the amount of damage die the genjutsu has by the same amount."
  },
  {
    "clan": "Kashu Clan",
    "title": "Potent Genjutsu",
    "details": "Beginning at 18th level, as long as you are equipped with your Auditory Ninja Tool, when you would inflict damage with a genjutsu with the Auditory keyword you can instead as a bonus action, deal maximum damage. This can be done twice per long rest."
  },
  {
    "clan": "Keton Clan",
    "title": "Ability Score Increase (Keton)",
    "details": "+2 Con, +1 Cha"
  },
  {
    "clan": "Keton Clan",
    "title": "Speed (Keton)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Keton Clan",
    "title": "Skill Proficiencies (Keton)",
    "details": "Performance, Chakra Control"
  },
  {
    "clan": "Keton Clan",
    "title": "Plasma Release Affinity",
    "details": "You begin with either Fire or Lightning Release Affinity. (Pick One)\n Keton Features"
  },
  {
    "clan": "Keton Clan",
    "title": "Plasma Techniques",
    "details": "The Keton Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s). They do not need both Nature Release to use their Clan jutsu."
  },
  {
    "clan": "Keton Clan",
    "title": "Enlightening Grasp",
    "details": "Beginning at 1st level, you gain the ability to use your clan's kekkei genkai to produce light in any object you touch. As an action, you can place your palm on an object no larger than10 feet in any dimension. For the next 10 minutes, the object sheds bright light in a20-foot radius and dim light for an additional 20 feet. The light can be colored as you like. If the object is completely covered in something opaque, the light is blocked.\n You can spend 5 chakra to increase the duration of this feature on an object effected from 10 minutes to1 hour. You can dismiss the light from as many objects you have affected with this feature as an action. If you target an object being held or worn by a hostile creature, the creature must succeed a Dexterity saving throw vs. your Ninjutsu Save DC to avoid this feature.\n You can use this feature a number of times equal to your proficiency bonus per short rest. Alternatively, you can spend 5 chakra (no action required) to gain an additional number of uses equal to half your proficiency bonus."
  },
  {
    "clan": "Keton Clan",
    "title": "Stargazer",
    "details": "Due to the nature of your clan's light producing kekkei genkai, members of your clan have an incredible tolerance to bright light. Starting at 1st level, you have advantage on saving throws to avoid gaining the blinded or dazzled conditions.\n At 11th level, you have advantage on saving throws to avoid effects that would alter your visual perception.\n At 18th level, you become immune to the Blinded and Dazzled conditions."
  },
  {
    "clan": "Keton Clan",
    "title": "Energy Overflow",
    "details": "Starting at 3rd level, your chakra begins to radiate energy akin to the power of a supernova. Each time you would take damage that is not self-inflicted or cast a jutsu with the Fire or Lightning Release keywords, you can gain an Energy Die at the start of your next turn, which are d6s. Your Energy Die becomes d8s at 11th level and d10s at 18th level. You can hold a maximum amount of Energy Die equal to half your proficiency bonus, rounded up.\n Whenever you cast a jutsu with the Fire or Lightning Release keywords, you can spend any number of Energy Die, adding it to the damage roll. When you use Energy Die this way, your jutsu creates bright light for a number of feet equal to the distance your jutsu traveled, until the end of the turn. The light can be colored however you like."
  },
  {
    "clan": "Keton Clan",
    "title": "Plasma Release",
    "details": "The Keton clan has a unique talent for manifesting Plasma Release due to their close affinity to Fire Release and Lightning Release. Starting at 7th level, you gain the second nature release you didn’t choose from the Plasma Release Affinity clan trait.\n Also at 7th level, when casting a jutsu with the Fire or Lightning Release keywords, you can change the damage type to fire damage. When casting a Keton Clan Hijutsu, you can reduce the cost of the jutsu by 2 (Min. 1)."
  },
  {
    "clan": "Keton Clan",
    "title": "Superheated Chakra",
    "details": "You have become adept at molding the particles in the air into plasma with every strike, turning light into your ultimate weapon. Starting at 11th level, all attacks you make that deal fire damage have their critical threat range increased by +1.\n Also at 11th level, all Keton Clan Hijutsu you cast ignore resistance to Fire damage and treat immunity as resistance.\n Starting at 15th level, when you\n would use your Energy Overflow\n feature on a Keton Hijutsu, you\n ignore both resistance and\n immunity to fire damage."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Ability Score Increase (Konjiki)",
    "details": "+2 Int, +1 Str or Con"
  },
  {
    "clan": "Konjiki Clan",
    "title": "Speed (Konjiki)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Skill Proficiencies (Konjiki)",
    "details": "Crafting, Ninshou"
  },
  {
    "clan": "Konjiki Clan",
    "title": "Steel Release (Konjiki)",
    "details": "You begin with the Earth Release Affinity."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Earth Literacy",
    "details": "Your Ninjutsu ability score is counted as being +2 higher, for the purpose of casting jutsu of B-Rank or higher with the Earth Release Keyword through any ability score restrictions (SHB, pg.104).\n Konjiki Features"
  },
  {
    "clan": "Konjiki Clan",
    "title": "Metal Techniques",
    "details": "The Konjiki Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Earth Release Simplicity",
    "details": "When creating or learning Ninjutsu with the Earth Release affinity reduce the time it takes to complete the task by half. This does not stack\n with other similar effects."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Weapon Formation",
    "details": "Members of the Konjiki clan are able to utilize the malleability of their Steel Release to augment their Hijutsu for many situations. Beginning at 1st level, when you cast a Konjiki Hijutsu, you can choose for it to deal Bludgeoning, Piercing, or Slashing damage. Your Hijutsu gains a unique benefit based on the damage type chosen. If no damage type is chosen, your Hijutsu deals Earth damage.\n Beginning at 15th level, you can choose to split the damage dealt between two damage types, allowing your Hijutsu to gain both associated unique benefits."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Bludgeoning",
    "details": "If the target is Bruised, they take an extra 3 damage per rank of Bruised they possess, instead of 2. At 7th level, once per casting when you score a critical hit or a creature critically fails their saving throw against your Hijutsu, they gain 1 rank of Bruised."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Piercing",
    "details": "Your jutsu ignores an amount of the target’s DR equal to half your proficiency bonus, rounded up. At 7th level, once per casting when you score a critical hit or a creature critically fails their saving throw against your Hijutsu, they gain 1 rank of Weakened."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Slashing",
    "details": "Your Hijutsu gains a +10 bonus to range and increases any area of effects by 5ft. in all directions. At 7th level, once per casting when you score a critical hit or a creature critically fails their saving throw against your Hijutsu, they gain 1 rank of Lacerated."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Blood of the Earth",
    "details": "Beginning at 3rd level, when you are wearing Light or Medium Armor you can use Intelligence in place of Dexterity for your Armor Class and you ignore difficult terrain while you are on land, always being able to sense the best possible path to take to navigate out of a less than optimal situation.\n At 11th level, while you are on land you gain a\n tremor sense of 60 feet."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Perfected Creation",
    "details": "Also at 3rd level, before even fully realizing your clan’s kekkei genkai you have learned how to mold Earth Release to be sturdier and more stable. When you cast a jutsu with the Earth Release keyword that summons a construct, you may spend an additional amount of chakra equal to the rank of the jutsu cast to grant the construct a +1 to its AC, +3 to any damage reduction it possesses, and grant it a +1d4 bonus to damage rolls. (D/C-Rank: 2, B/A-Rank: 4, S-Rank: 6)\n Beginning at 15th level, Konjiki Hijutsu always gain these benefits, regardless of whether you spend chakra."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Steel Release (Konjiki)",
    "details": "Beginning at 7th level, you have gained the ability to enhance normal Earth Release Jutsu by adding piles of steel into the earth. When you cast a jutsu with the Earth Release keyword, once per casting, you can choose to increase the damage die or temporary hit points of the jutsu by 1 step (D4<D6<D8 <D10<D12) or gain a +1 to attack rolls.\n Additionally, when casting Konjiki Hijutsu, reduce the cost of the jutsu by -1."
  },
  {
    "clan": "Konjiki Clan",
    "title": "Reinforced and Pressurized",
    "details": "Beginning at level 11th level, you can enhance constructs made from your chakra, when you cast a jutsu with the earth release keyword that creates a construct or gives Temporal Hit Points, the construct or the target creature gains an additional amount of Temp Hit Points or Hit Points equal to your Character Level. Additionally, constructs created with the Earth Release keyword lose any vulnerabilities or inability to defend against Lightning Release or Genjutsu.\n Starting at 18th level you instead add twice your character level to the hit points or temporary hit points gained.\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n D-Rank"
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Ability Score Increase (Shí Hóu)",
    "details": "+2 Con, +1 Str or Dex"
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Speed (Shí Hóu)",
    "details": "Your base walking speed is 35 feet"
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Skill Proficiencies (Shí Hóu)",
    "details": "Chakra control, Pick one between:\n Ninshou, Martial Arts."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Weapon Proficiencies (Shí Hóu)",
    "details": "Quarterstaff\n Shí Hóu Features"
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Shí Hóu Agility",
    "details": "You gain a climbing speed equal to your walking speed."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Tail",
    "details": "From birth you have a monkey-like tail of any color you wish. At 1st level, your tail is strong enough to hold small objects such as lanterns or Kunai, keeping your hands free. You may use a bonus action to make a ranged weapon attack with a weapon with the thrown and light property.\n Beginning at the 11th level you can make 2 attacks."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Monkeys Paw",
    "details": "At 1st level you find yourself more dexterous and able bodied as you tap into your inner primate. A number of times equal to your proficiency bonus per long rest, when you would roll a Strength or Dexterity skill check, you may add a 1d4 to the roll. This bonus increases to a 1d6 at the 7th level and a 1d8 at the 11th level."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Inner Chi",
    "details": "The Shi Hou clan has always been gifted with miraculous chakra control as a result of their Sage ancestry. Beginning at 3rd level, you gain 10 Inner Chi. You gain 1 additional Inner Chi at each level. Inner Chi can be used in place of chakra for the casting of Taijutsu. When you would cast a Taijutsu with at least an amount of Inner chi equal to its rank, (D=1, C=2, B=3, A=4, S=5) that jutsu gains either 1 additional damage die (once per casting) or gains +1 to hit (pick one).\n While concentrating on jutsu that you cast with Inner Chi, pay concentration cost as if you had cast it with normal chakra. When you would gain the benefit of a short rest, you regain Inner Chi equal to half your maximum. All Inner Chi replenishes on a long rest."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "72 Earthly Transformations",
    "details": "As a member of the Shi Hou clan you can tap into your ancestral powers and utilize an unique adaptation of the transformation technique to empower your taijutsu. Beginning at the 3rd level you gain 3 of the following Simple Transformations. Transformations that require a saving throw, use your Taijutsu Save DC. To activate this feature you must spend 1 additional Inner Chi as a part of casting a Taijutsu. You can only use one Simple, Advanced, or Mythical Transformation once per casting.\n Beginning at the 7th level you gain access to 2 of the following Advanced Transformations. These transformations require 2 additional Inner Chi to be spent as part of casting a Taijutsu.\n Beginning at the 15th Level you may choose one of the following legendary transformations for your 72 Earthly Transformations. These transformations are considered Mythic Transformations require 4 additional Inner Chi to be spent as part of a jutsu's casting to use."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Bear Form",
    "details": "When you would cast a Taijutsu that makes a single attack, on a hit the creature must succeed a Strength saving throw or fall prone, and reduce their movement speed to 0 until the start of their next turn."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Bull Form",
    "details": "When you cast a Taijutsu that requires at least one melee attack, creature(s) hit by this jutsu must succeed a Strength save or be knocked 30 feet into the air."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Hawk Form",
    "details": "When you cast a Taijutsu on your turn, until the end of the current turn, you cannot have your speed reduced by any means (Including from Conditions)."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Owl Form",
    "details": "When you would cast a Taijutsu with a duration of 1 minute or longer, for the duration of the Taijutsu, you may use your Taijutsu ability modifier for Perception, Insight, and Investigation checks (this enables you to use Monkey’s Paw with these checks). You also gain darkvision equal to your normal sight range and can take the Search Action as a bonus action for the duration."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Snake Form",
    "details": "When you would cast a Taijutsu that makes a single attack, the damage type becomes piercing and on hit the target must succeed a Constitution save or become envenomed for 1 minute."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Mink Form",
    "details": "When you would cast a Taijutsu with more than one attack roll, with each successful attack roll you increase the damage rolls of the jutsu by +1, up to a maximum damage bonus equal to your proficiency bonus."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Tiger Form",
    "details": "When you cast a Taijutsu that makes two or less attacks, increase the critical threat range by +2."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Turtle Form",
    "details": "When you would cast a Taijutsu that covers an area of effect or requires no more than two attack rolls, gain temporary hit points equal to half the damage dealt until the start of your next turn. Taijutsu affected by this form cannot score a critical hit."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Wolf Form",
    "details": "When you would cast a jutsu with more\n than one attack roll, the damage type becomes slashing and upon the conclusion of the jutsu, the target must make a Constitution saving throw with a penalty equal to the number of attacks they were hit by using your jutsu. On a failed saving throw, the creature gains ranks of bleeding equal to this penalty."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Dragon Form",
    "details": "When you would cast a damage dealing Taijutsu, your jutsu deals an additional amount of damage equal to twice the number of the jutsu’s damage die, and has its damage type changed to fire, once per casting. (Ex. A jutsu that deals 6d10 bludgeoning damage, now deals 6d10+12 fire damage)."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Pegasus Form",
    "details": "When you would cast a taijutsu, if it does damage, change the damage type to wind. You also gain a flight speed equal to your movement speed until the end of the current turn."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Phoenix Form",
    "details": "When you would cast a Taijutsu as a reaction, regain hit points equal to your Taijutsu Save DC."
  },
  {
    "clan": "Shí Hóu Clan",
    "title": "Immortal Techniques",
    "details": "Beginning at the 18th level you can spend 3 Inner Chi to re-roll a death save up to twice per turn. If you succeed 3 death saves or roll a natural 20 on a death save you regain hit points equal to twice your Taijutsu save DC."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Ability Score Increase (Synthetic Human)",
    "details": "+2 Int, +1 Cha"
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Speed (Synthetic Human)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Skill Proficiencies (Synthetic Human)",
    "details": "Perception, Survival."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Extra Language (Synthetic Human)",
    "details": "Snake-Speak, you can understand and speak to snakes."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Weapon Proficiencies (Synthetic Human)",
    "details": "You are proficient with Katanas and Broadswords"
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Snake Techniques",
    "details": "You know one additional Synthetic clan D-Rank Jutsu\n Synthetic Features"
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Synthetic Techniques",
    "details": "The Synthetic Human Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Soft Physique Modification",
    "details": "Beginning at 1st level, your body allows you to move in unnatural ways. By dislocating your body's joints and then using chakra to manipulate them, you are capable of extending and flexing in a supernatural way. You can extend your arms 15 feet away whenever you want. While in combat, you may activate this feature as a free action. While gaining the benefit of this feature, your unarmed attack range is 15 feet and you have advantage on grapple checks. You may use Acrobatics instead of Athletics for those grapple checks. While gaining the range benefit, you suffer a -2 penalty to Taijutsu attacks. The range of this feature increases by 5 feet at 7th, 11th, and 15th levels."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Immune System",
    "details": "Beginning at 7th level you have a high resistance to poison and sickness. You are Resistant to Poison damage. Additionally, you roll at advantage to resist the effects of viruses and diseases on your body.\n At 11th level your immune system is far greater than the others around you. Reduce all poison damage by your proficiency bonus. Additionally, you become immune to any virus or disease that you have overcome in the past, and you can provide antibodies to others via a blood transfusion. For each blood transfusion you create you must spend 1 hit die. When a creature uses a blood transfusion, they gain advantage to all saving throws to resist the effects of viruses and diseases for 1 hour.\n At 18th level you gain immunity to poison damage and effects caused by Poison Damage."
  },
  {
    "clan": "Synthetic Human Clan",
    "title": "Corrupted Chakra Mode",
    "details": "Beginning at 3rd level, you gain the ability to access your clan’s most powerful ability Corrupted Chakra Mode. Corrupted Chakra Mode pulls in a small amount of nature energy, gives your hair a fiery appearance, causes a horn to grow out of your forehead, and causes your veins to budge and turn black. You may enter this form as an Action, twice per long rest, for up to 1 minute. At 11th level you may now transform as a bonus action. You can transform an additional time per long rest at 18th levels. For its duration you gain the following benefits;\n You gain tremorsense up to 30 feet and while a creature is within your tremorsense range you cannot be surprised by them.\n As a part of entering your Corrupted Chakra Mode, you gain temporary chakra points equal to your character level. Beginning at 7th level, when you would use these temporary chakra points to cast a Synthetic Human Hijutsu its upcasted to the next level at no additional cost. If the jutsu cannot be upcasted, it gains an additional damage die.\n As a part of entering your Corrupted Chakra Mode, you gain temporary Hit points equal to twice your character level. Beginning at 7th level, when you have these temporary hit points you are resistant to bludgeoning, piercing, and slashing damage.\n The damage die for slashing and piercing weapons you wield, is increased by 1 step and are counted as being chakra enhanced.\n Your speed increases by 10 feet and you gain a climbing speed equal to your movement speed. These bonuses increase to 20 feet at 11th level and 30 feet at 15th level.\n At 7th level, you no longer have a penalty to Taijutsu attacks when using Soft Physique Modification.\n At 15th level when you would deal poison damage you deal additional poison damage equal to your proficiency bonus, up to two times per casting or action.\n At 18th level you are immune to the slowed and\n weakened conditions.\n \n Synthetic Human Jutsu\n D-Rank\n Hidden Shadow Snake Hands"
  },
  {
    "clan": "Vesper Clan",
    "title": "Ability Score Increase (Vesper)",
    "details": "+2 Cha, +1 Str or Dex"
  },
  {
    "clan": "Vesper Clan",
    "title": "Speed (Vesper)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Vesper Clan",
    "title": "Skill Proficiencies (Vesper)",
    "details": "Acrobatics, Stealth"
  },
  {
    "clan": "Vesper Clan",
    "title": "Visual Literacy",
    "details": "All ability scores are counted as being +2 higher, for the purpose of casting Higher Ranked Genjutsu with the Visual Keyword through any Ability Score Restrictions.\n Vesper Features"
  },
  {
    "clan": "Vesper Clan",
    "title": "Vesper Clan Techniques",
    "details": "Vesper clan members have access to their own list of secret jutsu that only those with their kekkei genkai may use."
  },
  {
    "clan": "Vesper Clan",
    "title": "Charming Persona (Vesper)",
    "details": "Beginning at 1st level, Vesper clan members may use Charisma instead of Wisdom as the casting modifier for Genjutsu with the Hijutsu keyword."
  },
  {
    "clan": "Vesper Clan",
    "title": "Supreme Nightvision",
    "details": "Also at 1st level, Vesper Clan members gain 120ft of Darkvision and you can see through light obscurement with no difficulty.\n Also, while under the cover of darkness you may use Stealth Skill-Based Actions as a bonus action, and may move up to your full movement speed while in Stealth.\n At 7th level, Vesper Clan members perceive color through their Darkvision and you can see through heavy obscurement.\n At 11th level, while you are not in direct Sunlight, you may spend 3 chakra to gain 30 feet of flying speed until the end of the current turn. When you would land after using this flight, you do not take fall damage."
  },
  {
    "clan": "Vesper Clan",
    "title": "Superior Being. Blessed with the genetics of the ancient Sage Bat, your physiology is inherently molded for greatness. At 3rd level, you gain the following traits",
    "details": "Your Movement speed increases by 5ft, and you gain a wall walking speed equal to your movement speed.\n You have advantage on Strength Checks to Push, Pull and Drag objects.\n As a reaction to making a Strength or Dexterity saving throw, you may spend 3 chakra to make at advantage. At 11th level, you may spend 7 chakra to do this without spending a reaction, up to two times per round."
  },
  {
    "clan": "Vesper Clan",
    "title": "Genjutsu Resilience",
    "details": "Starting at 7th level, your unique insight into Genjutsu also makes you extremely resilient to it. You have advantage on saving throws against Genjutsu with the Auditory or Visual keywords."
  },
  {
    "clan": "Vesper Clan",
    "title": "Enthralling Strength",
    "details": "Beginning at 11th level, creatures charmed by your Vesper Features/Hijutsu make their next check or saving throw to end the condition at disadvantage.\n Also, twice per rest when you hit a creature with a Taijutsu attack (or an unarmed/weapon attack, with Claws of the Night active), or the creature would fail a saving throw against a Genjutsu you cast, you can automatically Charm the creature. A creature charmed this way, does not stop being charmed the first time you damage them after giving them this rank of charmed."
  },
  {
    "clan": "Vesper Clan",
    "title": "Immortal",
    "details": "At 15th level, you become truly immortal, unable to age any further, unless you willingly allow yourself to. This new outlook on life has significantly altered your ability to feel fear.\n Additionally, you are immune to the Charmed condition, and can gain no more than 2 ranks of the Frightened condition."
  },
  {
    "clan": "Vesper Clan",
    "title": "Supreme Being",
    "details": "At 18th level, you gain additional features to your Superior Being feature;\n If you would roll below a 13 on the d20 on an initiative roll, you treat your d20 roll as a 13. You may also cast any Vesper Hijutsu, Taijutsu, or Genjutsu with a duration greater than instant that does not affect a hostile creature, as part of rolling initiative.\n Any Vesper clan features that would be inhibited by Sunlight to any degree, lose this weakness.\n Once per round, you may command a creature Charmed by you to one Action that they are able to take. Each time you command a creature this way, they may reattempt their saving throw to end the Charmed condition after the Action is performed."
  },
  {
    "clan": "Yamada Clan",
    "title": "Ability Score Increase (Yamada)",
    "details": "+2 Dex, +1 Str or Wis"
  },
  {
    "clan": "Yamada Clan",
    "title": "Speed (Yamada)",
    "details": "Your base walking speed is 30 feet"
  },
  {
    "clan": "Yamada Clan",
    "title": "Skill Proficiency (Yamada)",
    "details": "Martial Arts, Medicine"
  },
  {
    "clan": "Yamada Clan",
    "title": "Tool Proficiency",
    "details": "Medicine Kit"
  },
  {
    "clan": "Yamada Clan",
    "title": "Weapon Proficiency",
    "details": "Katana, Odachi\n Yamada Features"
  },
  {
    "clan": "Yamada Clan",
    "title": "Single-Swing Practitioner",
    "details": "The Yamada Clan has access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list(s)."
  },
  {
    "clan": "Yamada Clan",
    "title": "Talented Blade",
    "details": "Beginning at 1st level, when you deal damage with a Katana or Odachi using Strength or Dexterity you add half (rounded down) of the other ability modifier to the damage. This increases to the full modifier at 15th level. You cannot add the same modifier more than once to a damage roll this way.\n Additionally, you may use Dexterity when calculating the Attack, Damage, and Save DC of your Yamada Clan Hijutsu."
  },
  {
    "clan": "Yamada Clan",
    "title": "Balance of Emotion",
    "details": "At 3rd level, as a Yamada you have learned to find the balance in between emotions, you gain a new resource called Balance die, which are d6’s. You have a number of Balance die equal to half your level (rounded up). You can spend Balance die on the following effects once per turn and regain any spent Balance die on a Long Rest."
  },
  {
    "clan": "Yamada Clan",
    "title": "Balanced Edge",
    "details": "When you deal damage with a weapon or taijutsu attack using a Katana or Odachi, you can spend any number of Balance die you have remaining, adding them to the damage roll."
  },
  {
    "clan": "Yamada Clan",
    "title": "Balanced Focus",
    "details": "When you make a weapon or taijutsu attack using a Katana or Odachi and would roll a natural 1 on the d20, you may spend 2 Balance Die, rerolling the d20 and taking the higher result for the attack. If you score a hit this way, add one of the Balance die rolled to the damage dealt."
  },
  {
    "clan": "Yamada Clan",
    "title": "Balanced Precision",
    "details": "When you make a weapon\n or taijutsu attack using a Katana or Odachi.\n You may spend 1 Balance die, adding it to the\n attack roll."
  },
  {
    "clan": "Yamada Clan",
    "title": "Balanced Insight",
    "details": "When you force a creature to \n make a saving throw with a bukijutsu using a \n Katana or Odachi, you can spend and roll 1 Balance die, \n adding half the result to your Save DC.\n When you reach 15th level, you may use 2 of these effects per turn."
  },
  {
    "clan": "Yamada Clan",
    "title": "Single-Swing Style I",
    "details": "At 7th level, if you have a feature that allows you to make multiple attacks you can choose to instead make a single attack, dealing the damage from all attacks. Any bonuses to critical hit damage are only added once (Ex. Critical Feats, the Deadly property, etc)"
  },
  {
    "clan": "Yamada Clan",
    "title": "Sharpened Edge",
    "details": "Starting at 11th level, whenever you would deal damage with a Katana or Odachi and roll the maximum value on a die from either your weapon’s damage or jutsu’s damage, the die explodes, meaning you roll an additional die per roll.\n This feature can trigger up three times per instance of damage, and if the damage is connected to an ability that would cause a unique effect if a certain amount of damage die are rolled to a specific value (Ex. The special effects of the Crescent Moon Beheading jutsu), the exploding dice can only contribute to such effects, once."
  },
  {
    "clan": "Yamada Clan",
    "title": "Single-Swing Style II",
    "details": "Beginning at 15th level, when you cast a Bukijutsu that uses a Katana or Odachi that has multiple attacks, you may choose to instead make one attack and deal the damage from all attacks. If you were to score a Critical Hit while using this feature, you do not double all damage dice, only the damage dice of what would have been the first attack."
  },
  {
    "clan": "Yamada Clan",
    "title": "Empty Blade",
    "details": "Finally at 18th level, you have perfected your ability to cut off all emotion from your blade, acting solely on instinct. You can enter the Empty Blade form as a bonus action on your turn by spending 5 Balance Die, while in this form you gain the following benefits:\n Your Katana and Odachi deal an additional die of damage.\n If you start your turn with no Balance Die, you gain a number equal to half your Wisdom Modifier (min 1).\n You can declare all of your actions for the turn, and then condense all attacks from them into one single decisive swing dealing all damage and effects. This feature works across actions and jutsu.\n You can maintain this stance for 1\n minute, after which you are\n emotionally drained and can no\n longer use your Balance of\n Emotion clan feature until you \n complete a full rest."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Ability Score Increase (Hoshigaki)",
    "details": "+2 Con, +1 Str or Dex"
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Speed (Hoshigaki)",
    "details": "Your base walking speed is 30 feet."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Skill Proficiencies (Hoshigaki)",
    "details": "Animal Handling, Athletics"
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Weapon Proficiencies",
    "details": "Great Axe, Naginata, Odachi (Greatsword), Scythe, Tetsubo"
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Dark Vision",
    "details": "You have Darkvision up to 30 feet."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Passive Affinity",
    "details": "You have Water Release Affinity (You can learn Ninjutsu with the Water Release Keyword)"
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Water Literacy",
    "details": "You reduce the ability score requirement to learn and cast Jutsu with the Water Release keyword by 2. For Ability score requirements, check the SHB, pg.121).\n Hoshigaki Features"
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Aquatic Adaptation",
    "details": "You have a Swimming and Water walking speed equal to your walking speed."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Amphibious (Hoshigaki)",
    "details": "You can breathe air and Water."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Water Release Simplicity",
    "details": "When creating or learning Ninjutsu with the Water Release affinity reduce the time it takes to complete the task by half. This does not stack with other similar effects."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Commander of the Deep",
    "details": "Beginning at 1st level, aquatic creatures have an affinity with people of your clan. You can communicate simple ideas with beasts that can breathe Water. They can understand the meaning of your words, though you have no special ability to control them directly. Starting at 7th level you learn the Summoning Technique D-Rank ninjutsu with a contract with the Shark tribe. You can cast this jutsu ignoring Ability Score Requirements. The Shark tribe you are contracted with are a bit more powerful than other shark tribes. This shark tribe gains additional ASI points equal to its rank. (D-Rank: +2, C-Rank: +3, B-Rank: +4, A-Rank +5, S-Rank: +6). Additionally, when you summon these sharks, they are summoned in a large bubble of Water that they use for land travel, using their swimming speed to traverse the land. If they ever end their turns more than 60 feet away from you and they are not in a body of Water that is not this bubble, they are automatically unsummoned."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Brute Strength [Changed]",
    "details": "Your immense strength lets you wield weapons in ways that others would find impossible. Beginning at 1st level, you gain proficiency in intimidation and weapons with the Versatile property deal their two-handed damage even if you wield them in one hand. Starting at 3rd level, when you are wielding one weapon, you can still use the hand holding it to cast jutsu with the hand seal (HS) and Chakra seal (CS) components, without putting the weapon down. Additionally, you always add your strength modifier to the damage rolls of to Bukijutsu you cast, unless otherwise specified. Starting at 7th level, while you have temporary chakra as a result of the Ravenous Chakra clan feature, you may add your proficiency bonus to damage rolls that use your strength twice per turn."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Ravenous Chakra [Changed]",
    "details": "Your body yearns to consume the Chakra of others. The stronger your enemies, the stronger you can become, using their energy to fuel you. Beginning at 3rd level, when you cast a jutsu with the Water release keyword, the jutsu also deals Chakra damage equal to the result. You gain a number of temporary Chakra points equal to the rank of the Jutsu cast (D-Rank: 2, C-Rank: 3, B-Rank: 4, A-Rank: 5, S-Rank: 6). You can use this feature twice per initiative roll. This increases to three times at 15th level.\n Beginning at 11th level, your jutsu can also consume the Chakra in other techniques as your jutsu becomes more shark like. If you would clash with a jutsu while using this feature, you gain a bonus to the clash check equal to 1d6. If you win the clash check, your jutsu deals additional damage equal to twice the losing Jutsu's cost."
  },
  {
    "clan": "Hoshigaki Clan",
    "title": "Shark Skinned Predator [Changed]",
    "details": "Beginning at 1st level, your skin begins to resemble that of a sharks becoming tougher and more resilient. You can use your Constitution instead of Dexterity to calculate your Armor Class.\n Starting, at 11rd level, you tap into your innate bloodline limit, allowing you to become one with your inner apex predator. As a bonus action on your turn, you enter a shark like form, growing large gills on your neck, large wing like fins grow from your shoulders down to your wrists, you grow webs between your fingers, your hair, if any fuses into your scalp, as your head, shoulders, and neck fuse into each other as your spine also grows into a long tail like appendage. You cannot cast Ninjutsu that does not have the Water Release Keyword. For the next minute you gain the following benefits;\n You can as an action perform a special action known as the Apex Gaze against a single creature you can see within 60 feet of you.\n Apex Gaze. Targets must make a Wisdom saving throw vs your Taijutsu or Ninjutsu save DC (Your choice). On a failure, the target gains 2 ranks of Demoralized.\n You have advantage on Strength & Constitution Checks.\n You gain a +2 bonus on Strength & Constitution Saving throws.\n You gain a swim speed and Water walking speed of twice your movement speed.\n You gain 30 feet of true sight while submerged underwater\n When you make a melee attack using strength, you gain a bonus to damage equal to your Constitution modifier.\n You have resistance to Bludgeoning, Piercing, or Slashing damage. (Pick 2, This can’t be changed later).\n Once you enter this form, you must complete a rest before you are able to enter this form again. You gain an additional use of this form beginning at 18th level."
  },
  {
    "clan": "Hanami Clan",
    "title": "Ability Score Increase (Hanami)",
    "details": "+2 Str, +1 Wis or Int"
  },
  {
    "clan": "Hanami Clan",
    "title": "Speed (Hanami)",
    "details": "Your base walking speed is 30 feet"
  },
  {
    "clan": "Hanami Clan",
    "title": "Skill Proficiency (Hanami)",
    "details": "Marital Arts, Medicine"
  },
  {
    "clan": "Hanami Clan",
    "title": "Medical Proficiency (Hanami)",
    "details": "You can add jutsu with the medical keyword to your jutsu list.\n Hanami Features"
  },
  {
    "clan": "Hanami Clan",
    "title": "Hanami Clan Jutsu",
    "details": "The Hanami have access to a separate list of Jutsu unique to their Clan. You can add these Jutsu to your jutsu list instead of selecting jutsu from the Normal jutsu list."
  },
  {
    "clan": "Hanami Clan",
    "title": "Medical Simplicity",
    "details": "When creating or learning jutsu with the medical keyword reduce the time it takes to complete the task by half. This does not stack with other similar effects."
  },
  {
    "clan": "Hanami Clan",
    "title": "Medical Fist",
    "details": "Beginning at 1st level, the Hanami are known for their brute strength and combative ability. When you cast a jutsu that uses your Unarmed Damage, you gain a +10ft. bonus to range and deal double damage to structures. Additionally, your [Unarmed Damage Die] becomes a 1d6.\n When you cast a Hanami Hijutsu, or Ninjutsu with the Medical keyword that makes a melee attack roll, you can use Strength as your casting modifier and treat the attack as a melee Taijutsu attack, adding your [Unarmed Damage] to the jutsu’s first damage roll, if it would not already include your unarmed damage.\n Starting at 7th level, your bonus to range becomes +20ft and when you would make a check to maintain concentration of a Taijutsu or jutsu with the Medical keyword, you may add your Strength modifier to the result.\n Starting at 11th level, your bonus to range becomes +30ft, and once per round, as part of casting a jutsu with the Taijutsu or Medical keyword that makes an attack, you can make one unarmed attack."
  },
  {
    "clan": "Hanami Clan",
    "title": "Combat Medicine",
    "details": "Beginning at 3rd level, you have drilled in the fundamentals of both medical and taijutsu. Once per rest, when you cast a Taijutsu, or take the Dash, Disengage, or Dodge actions, you can cast a Supportive Medical Jutsu with the casting time of one Action, as a bonus action. You gain additional uses of this feature at 7th and 15th levels."
  },
  {
    "clan": "Hanami Clan",
    "title": "Empowered Healing",
    "details": "Beginning at 3rd level, the potency of your medical chakra allows medical jutsu to go beyond their intended design and be even more beneficial. Twice per long rest, when you would use a jutsu with the Medical keyword that is Supportive, you may remove all ranks of any one condition affecting the creature as if you used the Restorative Ninjutsu, cast at your highest known jutsu rank.\n If you would cast a jutsu with the Medical keyword that removes conditions, you may spend a use of this feature to leave a remnant of your chakra within the creature, making them immune to gaining one condition removed again, from a hostile creature, for the next minute. You gain an additional use of this feature at 11th and 18th levels."
  },
  {
    "clan": "Hanami Clan",
    "title": "Hanami Boons",
    "details": "Beginning at 7th level, when you cast a jutsu with the Medical keyword, you can inflict one of the following Hanami Boons, based on whether the jutsu is Offensive or Supportive. You can provide one Hanami Boon per round, to all affected creatures. You may use this feature a number of times equal to half your proficiency bonus, rounded up, per long rest."
  },
  {
    "clan": "Hanami Clan",
    "title": "Blessed (Supportive)",
    "details": "Affected creatures gain a +1d4 bonus to their next attack roll, skill check, or saving throw. They also reduce the next instance of damage they take by half the healing given."
  },
  {
    "clan": "Hanami Clan",
    "title": "Unhindered (Supportive)",
    "details": "Affected creatures gain a +10 bonus to movement speed, ignore difficult terrain, and treat any penalties to d20 rolls as half their listed value. These effects last until the end of each affected creature’s turns."
  },
  {
    "clan": "Hanami Clan",
    "title": "Fragile (Offensive)",
    "details": "Affected creatures gain a -1d4 penalty to their next attack roll, skill check, or saving throw that uses Strength, Dexterity, or Constitution. They also take an additional 3 damage from unarmed, weapon, and Taijutsu attacks, up to four times total."
  },
  {
    "clan": "Hanami Clan",
    "title": "Dispirited (Offensive)",
    "details": "Affected creatures gain a -1d4 penalty to their next attack roll, skill check, or saving throw that uses Intelligence, Wisdom, or Strength. Any bonuses they receive from jutsu, features, or traits, are also halved until the start of your next turn."
  },
  {
    "clan": "Hanami Clan",
    "title": "Hardened Body, Hardened Mind",
    "details": "Beginning at 11th level, you have trained your body and\n mind to resist the will of others. Twice per long\n rest, when you are forced to make a Dexterity\n or Constitution saving throw you can instead\n make a Strength saving throw, alternatively\n when you are forced to make an Intelligence or\n Charisma Saving Throw you can instead make a\n Wisdom saving throw. You gain two extra uses\n of this feature at 15th level."
  },
  {
    "clan": "Hanami Clan",
    "title": "Overloaded Regeneration",
    "details": "Finally at 18th \n level, you have mastered both Taijutsu and \n Medical Jutsu and have learned to use them \n in tandem. When you cast a Taijutsu, you \n may immediately cast a Medical Jutsu that \n restores hit points on yourself as part of the \n same action.\n Additionally, medical jutsu you cast \n increase the size of their healing die by 1 step."
  }
]
